<?php
/**
 * 国家地区编码表
 * @param 
 * @return
 * @author luckyxiang,echiyang
 * @package /application/common/T_Comm_City
 */
class Core_Comm_City
{
	public static $cityConfig = array();
}

Core_Comm_City::$cityConfig['1'] = array('name'=>'中国','province'=>array(
                '11'=>array('name'=>'北京','city'=>array('1'=>'东城','2'=>'西城','3'=>'崇文','4'=>'宣武','5'=>'朝阳','6'=>'丰台','7'=>'石景山','8'=>'海淀','9'=>'门头沟','11'=>'房山','12'=>'通州','13'=>'顺义','21'=>'昌平','24'=>'大兴','26'=>'平谷','27'=>'怀柔','28'=>'密云','29'=>'延庆',)),
                '12'=>array('name'=>'天津','city'=>array('1'=>'和平','2'=>'河东','3'=>'河西','4'=>'南开','5'=>'河北','6'=>'红桥','7'=>'塘沽','8'=>'汉沽','9'=>'大港','10'=>'东丽','11'=>'西青','12'=>'津南','13'=>'北辰','21'=>'宁河','22'=>'武清','23'=>'静海','24'=>'宝坻','25'=>'蓟县',)),
                '13'=>array('name'=>'河北','city'=>array('1'=>'石家庄','2'=>'唐山','3'=>'秦皇岛','4'=>'邯郸','5'=>'邢台','6'=>'保定','7'=>'张家口','8'=>'承德','9'=>'沧州','10'=>'廊坊','11'=>'衡水',)),
                '14'=>array('name'=>'山西','city'=>array('1'=>'太原','2'=>'大同','3'=>'阳泉','4'=>'长治','5'=>'晋城','6'=>'朔州','7'=>'晋中','8'=>'运城','9'=>'忻州','10'=>'临汾','11'=>'吕梁',)),
                '15'=>array('name'=>'内蒙古','city'=>array('1'=>'呼和浩特','2'=>'包头','3'=>'乌海','4'=>'赤峰','5'=>'通辽','6'=>'鄂尔多斯','7'=>'呼伦贝尔','8'=>'巴彦淖尔','9'=>'乌兰察布','22'=>'兴安','25'=>'锡林郭勒','29'=>'阿拉善',)),
                '21'=>array('name'=>'辽宁','city'=>array('1'=>'沈阳','2'=>'大连','3'=>'鞍山','4'=>'抚顺','5'=>'本溪','6'=>'丹东','7'=>'锦州','8'=>'营口','9'=>'阜新','10'=>'辽阳','11'=>'盘锦','12'=>'铁岭','13'=>'朝阳','14'=>'葫芦岛',)),
                '22'=>array('name'=>'吉林','city'=>array('1'=>'长春','2'=>'吉林','3'=>'四平','4'=>'辽源','5'=>'通化','6'=>'白山','7'=>'松原','8'=>'白城','24'=>'延边',)),
                '23'=>array('name'=>'黑龙江','city'=>array('1'=>'哈尔滨','2'=>'齐齐哈尔','3'=>'鸡西','4'=>'鹤岗','5'=>'双鸭山','6'=>'大庆','7'=>'伊春','8'=>'佳木斯','9'=>'七台河','10'=>'牡丹江','11'=>'黑河','12'=>'绥化','27'=>'大兴安岭',)),
                '31'=>array('name'=>'上海','city'=>array('1'=>'黄浦','3'=>'卢湾','4'=>'徐汇','5'=>'长宁','6'=>'静安','7'=>'普陀','8'=>'闸北','9'=>'虹口','11'=>'杨浦','12'=>'闵行','13'=>'宝山','14'=>'嘉定','15'=>'浦东新','16'=>'金山','17'=>'松江','25'=>'南汇','26'=>'奉贤','29'=>'青浦','30'=>'崇明',)),
                '32'=>array('name'=>'江苏','city'=>array('1'=>'南京','2'=>'无锡','3'=>'徐州','4'=>'常州','5'=>'苏州','6'=>'南通','7'=>'连云港','8'=>'淮安','9'=>'盐城','10'=>'扬州','11'=>'镇江','12'=>'泰州','13'=>'宿迁',)),
                '33'=>array('name'=>'浙江','city'=>array('1'=>'杭州','2'=>'宁波','3'=>'温州','4'=>'嘉兴','5'=>'湖州','6'=>'绍兴','7'=>'金华','8'=>'衢州','9'=>'舟山','10'=>'台州','11'=>'丽水',)),
                '34'=>array('name'=>'安徽','city'=>array('1'=>'合肥','2'=>'芜湖','3'=>'蚌埠','4'=>'淮南','5'=>'马鞍山','6'=>'淮北','7'=>'铜陵','8'=>'安庆','10'=>'黄山','11'=>'滁州','12'=>'阜阳','13'=>'宿州','14'=>'巢湖','15'=>'六安','16'=>'亳州','17'=>'池州','18'=>'宣城',)),
                '35'=>array('name'=>'福建','city'=>array('1'=>'福州','2'=>'厦门','3'=>'莆田','4'=>'三明','5'=>'泉州','6'=>'漳州','7'=>'南平','8'=>'龙岩','9'=>'宁德',)),
                '36'=>array('name'=>'江西','city'=>array('1'=>'南昌','2'=>'景德镇','3'=>'萍乡','4'=>'九江','5'=>'新余','6'=>'鹰潭','7'=>'赣州','8'=>'吉安','9'=>'宜春','10'=>'抚州','11'=>'上饶',)),
                '37'=>array('name'=>'山东','city'=>array('1'=>'济南','2'=>'青岛','3'=>'淄博','4'=>'枣庄','5'=>'东营','6'=>'烟台','7'=>'潍坊','8'=>'济宁','9'=>'泰安','10'=>'威海','11'=>'日照','12'=>'莱芜','13'=>'临沂','14'=>'德州','15'=>'聊城','16'=>'滨州','17'=>'菏泽',)),
                '41'=>array('name'=>'河南','city'=>array('1'=>'郑州','2'=>'开封','3'=>'洛阳','4'=>'平顶山','5'=>'安阳','6'=>'鹤壁','7'=>'新乡','8'=>'焦作','9'=>'濮阳','10'=>'许昌','11'=>'漯河','12'=>'三门峡','13'=>'南阳','14'=>'商丘','15'=>'信阳','16'=>'周口','17'=>'驻马店','18'=>'济源',)),
                '42'=>array('name'=>'湖北','city'=>array('1'=>'武汉','2'=>'黄石','3'=>'十堰','5'=>'宜昌','6'=>'襄樊','7'=>'鄂州','8'=>'荆门','9'=>'孝感','10'=>'荆州','11'=>'黄冈','12'=>'咸宁','13'=>'随州','28'=>'恩施','94'=>'仙桃','95'=>'潜江','96'=>'天门','A21'=>'神农架',)),
                '43'=>array('name'=>'湖南','city'=>array('1'=>'长沙','2'=>'株洲','3'=>'湘潭','4'=>'衡阳','5'=>'邵阳','6'=>'岳阳','7'=>'常德','8'=>'张家界','9'=>'益阳','10'=>'郴州','11'=>'永州','12'=>'怀化','13'=>'娄底','31'=>'湘西',)),
                '44'=>array('name'=>'广东','city'=>array('1'=>'广州','2'=>'韶关','3'=>'深圳','4'=>'珠海','5'=>'汕头','6'=>'佛山','7'=>'江门','8'=>'湛江','9'=>'茂名','12'=>'肇庆','13'=>'惠州','14'=>'梅州','15'=>'汕尾','16'=>'河源','17'=>'阳江','18'=>'清远','19'=>'东莞','20'=>'中山','51'=>'潮州','52'=>'揭阳','53'=>'云浮',)),
                '45'=>array('name'=>'广西','city'=>array('1'=>'南宁','2'=>'柳州','3'=>'桂林','4'=>'梧州','5'=>'北海','6'=>'防城港','7'=>'钦州','8'=>'贵港','9'=>'玉林','10'=>'百色','11'=>'贺州','12'=>'河池','13'=>'来宾','14'=>'崇左',)),
                '46'=>array('name'=>'海南','city'=>array('1'=>'海口','2'=>'三亚','91'=>'五指山','92'=>'琼海','93'=>'儋州','95'=>'文昌','96'=>'万宁','97'=>'东方','A25'=>'定安','A26'=>'屯昌','A27'=>'澄迈','A28'=>'临高','A30'=>'白沙','A31'=>'昌江','A33'=>'乐东','A34'=>'陵水','A35'=>'保亭','A36'=>'琼中','A37'=>'西沙','A38'=>'南沙','A39'=>'中沙',)),
                '50'=>array('name'=>'重庆','city'=>array('1'=>'万州','2'=>'涪陵','3'=>'渝中','4'=>'大渡口','5'=>'江北','6'=>'沙坪坝','7'=>'九龙坡','8'=>'南岸','9'=>'北碚','10'=>'万盛','11'=>'双桥','12'=>'渝北','13'=>'巴南','21'=>'长寿','22'=>'綦江','23'=>'潼南','24'=>'铜梁','25'=>'大足','26'=>'荣昌','27'=>'璧山','28'=>'梁平','29'=>'城口','30'=>'丰都','31'=>'垫江','32'=>'武隆','33'=>'忠县','34'=>'开县','35'=>'云阳','36'=>'奉节','37'=>'巫山','38'=>'巫溪','39'=>'黔江','40'=>'石柱','41'=>'秀山','42'=>'酉阳','43'=>'彭水','81'=>'江津','82'=>'合川','83'=>'永川','84'=>'南川',)),
                '51'=>array('name'=>'四川','city'=>array('1'=>'成都','3'=>'自贡','4'=>'攀枝花','5'=>'泸州','6'=>'德阳','7'=>'绵阳','8'=>'广元','9'=>'遂宁','10'=>'内江','11'=>'乐山','13'=>'南充','14'=>'眉山','15'=>'宜宾','16'=>'广安','17'=>'达州','18'=>'雅安','19'=>'巴中','20'=>'资阳','32'=>'阿坝','33'=>'甘孜','34'=>'凉山',)),
                '52'=>array('name'=>'贵州','city'=>array('1'=>'贵阳','2'=>'六盘水','3'=>'遵义','4'=>'安顺','22'=>'铜仁','23'=>'黔西南','24'=>'毕节','26'=>'黔东南','27'=>'黔南',)),
                '53'=>array('name'=>'云南','city'=>array('1'=>'昆明','3'=>'曲靖','4'=>'玉溪','5'=>'保山','6'=>'昭通','7'=>'丽江','8'=>'普洱','9'=>'临沧','23'=>'楚雄','25'=>'红河','26'=>'文山','28'=>'西双版纳','29'=>'大理','31'=>'德宏','33'=>'怒江','34'=>'迪庆',)),
                '54'=>array('name'=>'西藏','city'=>array('1'=>'拉萨','21'=>'昌都','22'=>'山南','23'=>'日喀则','24'=>'那曲','25'=>'阿里','26'=>'林芝',)),
                '61'=>array('name'=>'陕西','city'=>array('1'=>'西安','2'=>'铜川','3'=>'宝鸡','4'=>'咸阳','5'=>'渭南','6'=>'延安','7'=>'汉中','8'=>'榆林','9'=>'安康','10'=>'商洛',)),
                '62'=>array('name'=>'甘肃','city'=>array('1'=>'兰州市','2'=>'嘉峪关','3'=>'金昌','4'=>'白银','5'=>'天水','6'=>'武威','7'=>'张掖','8'=>'平凉','9'=>'酒泉','10'=>'庆阳','11'=>'定西','12'=>'陇南','29'=>'临夏','30'=>'甘南',)),
                '63'=>array('name'=>'青海','city'=>array('1'=>'西宁','21'=>'海东','22'=>'海北','23'=>'黄南','25'=>'海南','26'=>'果洛','27'=>'玉树','28'=>'海西',)),
                '64'=>array('name'=>'宁夏','city'=>array('1'=>'银川','2'=>'石嘴山','3'=>'吴忠','4'=>'固原','5'=>'中卫',)),
                '65'=>array('name'=>'新疆','city'=>array('1'=>'乌鲁木齐','2'=>'克拉玛依','21'=>'吐鲁番','22'=>'哈密','23'=>'昌吉','27'=>'博尔塔拉','28'=>'巴音郭楞','29'=>'阿克苏','30'=>'克孜勒苏','31'=>'喀什','32'=>'和田','40'=>'伊犁','42'=>'塔城','43'=>'阿勒泰','91'=>'石河子','92'=>'阿拉尔','93'=>'图木舒克','94'=>'五家渠',)),
                '71'=>array('name'=>'台湾','city'=>array('1'=>'台北市','2'=>'高雄市','3'=>'基隆市','4'=>'台中市','5'=>'台南市','6'=>'新竹市','7'=>'嘉义市','8'=>'台北县','9'=>'宜兰县','10'=>'桃园县','11'=>'新竹县','12'=>'苗栗县','13'=>'台中县','14'=>'彰化县','15'=>'南投县','16'=>'云林县','17'=>'嘉义县','18'=>'台南县','19'=>'高雄县','20'=>'屏东县','22'=>'台东县','23'=>'花莲县','21'=>'澎湖县',)),
                '81'=>array('name'=>'香港','city'=>array('HCW'=>'中西区','HEA'=>'东区','KKC'=>'九龙城区','KKT'=>'观塘区','HSO'=>'南区','KSS'=>'深水埗区','KWT'=>'黄大仙区','HWC'=>'湾仔区','KYT'=>'油尖旺区','NIS'=>'离岛区','NKT'=>'葵青区','NNO'=>'北区','NSK'=>'西贡区','NST'=>'沙田区','NTM'=>'屯门区','NTP'=>'大埔区','NTW'=>'荃湾区','NYL'=>'元朗区',)),
                '82'=>array('name'=>'澳门','city'=>array('OLF'=>'花地玛堂区','ANT'=>'圣安多尼堂区','CAT'=>'大堂区','LAW'=>'望德堂区','LAZ'=>'风顺堂区','TPA'=>'氹仔','CLN'=>'路环',)),
));
Core_Comm_City::$cityConfig['ALB'] = array('name'=>'阿尔巴尼亚','province'=>array(
                ''=>array('name'=>'','city'=>array('EL'=>'爱尔巴桑','DI'=>'迪勃拉','TR'=>'地拉那','DR'=>'都拉斯','VL'=>'发罗拉','FR'=>'费里','GJ'=>'吉诺卡斯特','KO'=>'科尔察','KU'=>'库克斯','LE'=>'莱什','BR'=>'培拉特','SH'=>'斯库台',)),
));
Core_Comm_City::$cityConfig['DZA'] = array('name'=>'阿尔及利亚','province'=>array(
                ''=>array('name'=>'','city'=>array('ADR'=>'阿德拉尔','ALG'=>'阿尔及尔','ADE'=>'艾因·德夫拉','ATE'=>'艾因·蒂姆尚特','AAE'=>'安纳巴','ORA'=>'奥兰','BAT'=>'巴特纳','BJA '=>'贝贾亚','BEC'=>'贝沙尔','EBA'=>'贝伊德','BIS'=>'比斯克拉','BOR'=>'布尔吉·布阿雷里吉','BLI'=>'布利达','BOU'=>'布迈德斯','BOA'=>'布依拉 　','TIP'=>'蒂巴扎','TIS'=>'蒂斯姆西勒特','GHA'=>'盖尔达耶','GUE'=>'盖尔马','KHE'=>'罕西拉','REL'=>'赫利赞','JIJ'=>'吉杰尔','DJE'=>'杰勒法','CZL'=>'君士坦丁','LAG'=>'拉格瓦特','MUA'=>'马斯卡拉','MED'=>'麦迪亚','MIL'=>'密拉','MOS'=>'莫斯塔加纳姆','MSI'=>'姆西拉','NAA'=>'纳阿马','SET'=>'塞蒂夫','SAI'=>'赛伊达','SKI'=>'斯基克达','SAH'=>'苏克·阿赫拉斯','ETA'=>'塔里夫','TAM'=>'塔曼拉塞特','TEB'=>'特贝萨','TLE'=>'特莱姆森','IOU'=>'提济乌祖','TIA'=>'提亚雷特','TIN'=>'廷杜夫','EOU'=>'瓦德','OUA'=>'瓦尔格拉','OEB'=>'乌姆布阿基','SBA'=>'西迪贝勒阿贝斯','CHL'=>'谢里夫','ILL'=>'伊利齐',)),
));
Core_Comm_City::$cityConfig['AFG'] = array('name'=>'阿富汗','province'=>array(
                ''=>array('name'=>'','city'=>array('HEA'=>'赫拉特','KBL'=>'喀布尔','KDH'=>'坎大哈','MZR'=>'马扎里沙里夫',)),
));
Core_Comm_City::$cityConfig['ARG'] = array('name'=>'阿根廷','province'=>array(
                ''=>array('name'=>'','city'=>array('PRA'=>'巴拉那　','VDM'=>'别德马','PSS'=>'波萨达斯','BHI'=>'布兰卡港','BUE'=>'布宜诺斯艾利斯','FMA'=>'福莫萨','JUJ'=>'胡胡伊','CTC'=>'卡塔马卡','COR'=>'科尔多瓦','CNQ'=>'科连特斯','VLK'=>'克劳斯城','COC'=>'肯考迪娅','IRJ'=>'拉里奥哈','LPG'=>'拉普拉塔','RES'=>'雷西斯滕匹亚','RGL'=>'里奥加耶戈斯','RCU'=>'里奥夸尔托','CRD'=>'里瓦达维亚海军准将城','ROS'=>'罗萨里奥','RWO'=>'罗森','MDQ'=>'马德普拉塔','MDZ'=>'门多萨','NQN'=>'内乌肯','SLA'=>'萨尔塔','SDE'=>'圣地亚哥-德尔埃斯特罗','SFN'=>'圣菲　','UAQ'=>'圣胡安　','AFA'=>'圣拉斐尔','LUQ'=>'圣路易斯','RSA'=>'圣罗莎','SMC'=>'圣米格尔-德图库曼','SNS'=>'圣尼古拉斯','REL'=>'特雷利乌','USH'=>'乌斯怀亚',)),
));
Core_Comm_City::$cityConfig['ARE'] = array('name'=>'阿拉伯联合酋长国','province'=>array(
                ''=>array('name'=>'','city'=>array('AZ'=>'阿布扎比','AL'=>'艾因','DU'=>'迪拜','SH'=>'沙迦',)),
));
Core_Comm_City::$cityConfig['ABW'] = array('name'=>'阿鲁巴',);
Core_Comm_City::$cityConfig['OMN'] = array('name'=>'阿曼','province'=>array(
                ''=>array('name'=>'','city'=>array('BA'=>'巴提奈地区','ZA'=>'达希莱地区','SH'=>'东部地区','MA'=>'马斯喀特省','MU'=>'穆桑达姆省 ','DA'=>'内地地区','WU'=>'中部地区','ZU'=>'佐法尔省',)),
));
Core_Comm_City::$cityConfig['AZE'] = array('name'=>'阿塞拜疆','province'=>array(
                ''=>array('name'=>'','city'=>array('ABS'=>'阿布歇隆','XAC'=>'哈奇马斯','KAL'=>'卡尔巴卡尔','QAZ'=>'卡扎赫','LAN'=>'连科兰','MQA'=>'密尔-卡拉巴赫','MSA'=>'穆甘-萨连','NQA'=>'纳戈尔诺－卡拉巴赫','NX'=>'纳希切万','PRI'=>'普利亚拉克斯','SA'=>'舍基','SMC'=>'苏姆盖特','SIR'=>'锡尔万','GA'=>'占贾',)),
));
Core_Comm_City::$cityConfig['ASC'] = array('name'=>'阿森松岛',);
Core_Comm_City::$cityConfig['EGY'] = array('name'=>'埃及','province'=>array(
                ''=>array('name'=>'','city'=>array('ASW'=>'阿斯旺','GBY'=>'古尔代盖','CAI'=>'开罗','SKH'=>'苏布拉开马','ALY'=>'亚历山大',)),
));
Core_Comm_City::$cityConfig['ETH'] = array('name'=>'埃塞俄比亚','province'=>array(
                ''=>array('name'=>'','city'=>array('AF'=>'阿法尔','AH'=>'阿姆哈拉','OR'=>'奥罗米亚','BG'=>'宾香古尔','DD'=>'德雷达瓦','GB'=>'甘贝拉各族','HR'=>'哈勒里民族','SN'=>'南方各族','SM'=>'索马里','TG'=>'提格雷','AA'=>'亚的斯亚贝巴',)),
));
Core_Comm_City::$cityConfig['IRL'] = array('name'=>'爱尔兰','province'=>array(
                ''=>array('name'=>'','city'=>array('OF'=>'奥法利','TP'=>'蒂珀雷里','DB'=>'都柏林','DG'=>'多内加尔','GW'=>'戈尔韦','KD'=>'基尔代尔','KK'=>'基尔肯尼','CV'=>'卡范','CW'=>'卡洛','KR'=>'凯里','CK'=>'科克','CL'=>'克莱尔','LF'=>'朗福德','LT'=>'劳斯','LA'=>'崂斯','LM'=>'利默里克','LR'=>'利特里姆','RC'=>'罗斯康芒 ','MY'=>'梅奥','MT'=>'米斯','MG'=>'莫内根','SL'=>'斯莱戈','WK'=>'威克洛','WX'=>'韦克斯福德 ','WF'=>'沃特福德　 ','WM'=>'西米斯',)),
));
Core_Comm_City::$cityConfig['EST'] = array('name'=>'爱沙尼亚','province'=>array(
                ''=>array('name'=>'','city'=>array('65'=>'贝尔瓦','37'=>'哈留','70'=>'拉普拉','57'=>'里亚内','67'=>'帕尔努','74'=>'萨雷','78'=>'塔尔图','82'=>'瓦尔加','84'=>'维良地','59'=>'维鲁','86'=>'沃鲁','39'=>'希尤','51'=>'耶尔韦','49'=>'耶盖瓦','44'=>'依达－维鲁',)),
));
Core_Comm_City::$cityConfig['AND'] = array('name'=>'安道尔','province'=>array(
                ''=>array('name'=>'','city'=>array('7'=>'安道尔城','5'=>'奥尔迪诺','3'=>'恩坎普','2'=>'卡尼略','8'=>'莱塞斯卡尔德－恩戈尔达','4'=>'马萨纳','6'=>'圣胡利娅－德洛里亚',)),
));
Core_Comm_City::$cityConfig['AGO'] = array('name'=>'安哥拉','province'=>array(
                ''=>array('name'=>'','city'=>array('CNO'=>'北宽扎','LNO'=>'北隆达','BGO'=>'本戈','BGU'=>'本格拉','BIE'=>'比耶','CAB'=>'卡宾达','CNN'=>'库内内','CCU'=>'宽多库邦戈','LUA'=>'罗安达','MAL'=>'马兰热','MOX'=>'莫希科','NAM'=>'纳米贝','CUS'=>'南宽扎','LSU'=>'南隆达','HUA'=>'万博','HUI'=>'威拉','UIG'=>'威热','ZAI'=>'扎伊尔',)),
));
Core_Comm_City::$cityConfig['AIA'] = array('name'=>'安圭拉',);
Core_Comm_City::$cityConfig['ATG'] = array('name'=>'安提瓜岛和巴布达',);
Core_Comm_City::$cityConfig['AUS'] = array('name'=>'澳大利亚','province'=>array(
                'NT'=>array('name'=>'北部地区','city'=>array('PAL'=>'北帕默斯顿','DRW'=>'达尔文',)),
                'ACT'=>array('name'=>'堪培拉','city'=>array('CBR'=>'堪培拉',)),
                'QLD'=>array('name'=>'昆士兰','city'=>array('BNE'=>'布里斯班','OOL'=>'黄金海岸','CNS'=>'凯恩斯','CUD'=>'日光海岸','TSV'=>'汤斯维尔','TWB'=>'图文巴',)),
                'SA'=>array('name'=>'南澳大利亚','city'=>array('ADL'=>'阿德莱德','PUG'=>'奥古斯塔港','MGB'=>'甘比亚山','WAY'=>'怀阿拉','PLO'=>'林肯港','MYB'=>'默里布里奇','PPI'=>'皮里港','VHA'=>'维克托港',)),
                'TAS'=>array('name'=>'塔斯马尼亚','city'=>array('BWT'=>'伯尼港','DPO'=>'德文波特','HBA'=>'霍巴特','LST'=>'朗塞斯顿',)),
                'VIC'=>array('name'=>'维多利亚','city'=>array('GEX'=>'吉朗','MEL'=>'墨尔本',)),
                'WA'=>array('name'=>'西澳大利亚','city'=>array('ALH'=>'奥尔巴尼','BUY'=>'班伯里','FRE'=>'弗里曼特尔港','GET'=>'杰拉尔顿','KGI'=>'卡尔古利','MDU'=>'曼哲拉','PER'=>'珀斯',)),
                'NSW'=>array('name'=>'新南威尔士','city'=>array('NTL'=>'纽卡斯尔','WOL'=>'伍伦贡','HBS'=>'悉尼',)),
));
Core_Comm_City::$cityConfig['AUT'] = array('name'=>'奥地利','province'=>array(
                ''=>array('name'=>'','city'=>array('BUR'=>'布尔根兰','TYR'=>'蒂罗尔','VOR'=>'福拉尔贝格','CAT'=>'克恩顿','SZG'=>'萨尔茨堡','UAU'=>'上奥地利','STY'=>'施蒂利亚','VDD'=>'维也纳','LAU'=>'下奥地利',)),
));
Core_Comm_City::$cityConfig['ALA'] = array('name'=>'奥兰群岛',);
Core_Comm_City::$cityConfig['BRB'] = array('name'=>'巴巴多斯岛',);
Core_Comm_City::$cityConfig['PNG'] = array('name'=>'巴布亚新几内亚','province'=>array(
                ''=>array('name'=>'','city'=>array('NO'=>'北部','BV'=>'布干维尔','EH'=>'东部高地','ES'=>'东塞皮克','EB'=>'东新不列颠','EN'=>'恩加','GU'=>'海湾','MD'=>'马当','MN'=>'马努斯','MB'=>'米尔恩湾','NC'=>'莫尔兹比港','MR'=>'莫罗贝','SH'=>'南部高地','SI'=>'钦布','SA'=>'桑道恩','WE'=>'西部','WH'=>'西部高地','WB'=>'西新不列颠','NI'=>'新爱尔兰',)),
));
Core_Comm_City::$cityConfig['BHS'] = array('name'=>'巴哈马',);
Core_Comm_City::$cityConfig['PAK'] = array('name'=>'巴基斯坦','province'=>array(
                ''=>array('name'=>'','city'=>array('PEW'=>'白沙瓦','LYP'=>'费萨拉巴德','GUJ'=>'故吉软瓦拉','HDD'=>'海德拉巴','KCT'=>'卡拉奇','LHE'=>'拉合尔','RWP'=>'拉瓦尔品第','MUX'=>'木尔坦','ISB'=>'伊斯兰堡',)),
));
Core_Comm_City::$cityConfig['PRY'] = array('name'=>'巴拉圭','province'=>array(
                ''=>array('name'=>'','city'=>array('AM'=>'阿曼拜','PH'=>'阿耶斯总统省','PA'=>'巴拉瓜里','BO'=>'博克龙','GU'=>'瓜伊拉','CG'=>'卡瓜苏','CN'=>'卡嫩迪尤','CZ'=>'卡萨帕','CC'=>'康塞普西翁','CD'=>'科迪勒拉','MI'=>'米西奥内斯','NE'=>'涅恩布库','AG'=>'上巴拉圭','AN'=>'上巴拉那','SP'=>'圣佩德罗','AS'=>'亚松森特别区','IT'=>'伊塔普亚','CE'=>'中央',)),
));
Core_Comm_City::$cityConfig['PSE'] = array('name'=>'巴勒斯坦','province'=>array(
                ''=>array('name'=>'','city'=>array('GZ'=>'加沙地带','WE'=>'西岸',)),
));
Core_Comm_City::$cityConfig['BHR'] = array('name'=>'巴林','province'=>array(
                ''=>array('name'=>'','city'=>array('5'=>'北部','1'=>'哈德','12'=>'哈马德','9'=>'里法','3'=>'麦纳麦　 ','2'=>'穆哈拉格','10'=>'西部 ','8'=>'伊萨城','7'=>'中部 ',)),
));
Core_Comm_City::$cityConfig['PAN'] = array('name'=>'巴拿马',);
Core_Comm_City::$cityConfig['BRA'] = array('name'=>'巴西','province'=>array(
                ''=>array('name'=>'','city'=>array('AC'=>'阿克里','AL'=>'阿拉戈斯','AP'=>'阿马帕','PR'=>'巴拉那','BSB'=>'巴西利亚','BA'=>'巴伊亚','RN'=>'北里奥格兰德','PE'=>'伯南布哥','GO'=>'戈亚斯','RO'=>'朗多尼亚','RJ'=>'里约热内卢','RR'=>'罗赖马','MA'=>'马拉尼昂','MT'=>'马托格罗索','MG'=>'米纳斯吉拉斯','RS'=>'南里奥格兰德','MS'=>'南马托格罗索','PA'=>'帕拉','PB'=>'帕拉伊巴','PI'=>'皮奥伊','CE'=>'塞阿拉','SE'=>'塞尔希培','ES'=>'圣埃斯皮里图','SP'=>'圣保罗','SC'=>'圣卡塔琳娜','TO'=>'托坎廷斯','AM'=>'亚马孙',)),
));
Core_Comm_City::$cityConfig['BLR'] = array('name'=>'白俄罗斯','province'=>array(
                ''=>array('name'=>'','city'=>array('BR'=>'布列斯特','HO'=>'戈梅利','HR'=>'格罗德诺','MI'=>'明斯克市','MA'=>'莫吉廖夫','VI'=>'维捷布斯克',)),
));
Core_Comm_City::$cityConfig['BMU'] = array('name'=>'百慕大',);
Core_Comm_City::$cityConfig['BGR'] = array('name'=>'保加利亚','province'=>array(
                ''=>array('name'=>'','city'=>array('BOJ'=>'布尔加斯','KHO'=>'卡斯科伏','ROU'=>'鲁塞','LVP'=>'洛维奇','OZA'=>'蒙塔纳','PDV'=>'普罗夫迪夫','SOF'=>'索非亚','GSO'=>'索非亚市','VAR'=>'瓦尔纳',)),
));
Core_Comm_City::$cityConfig['MNP'] = array('name'=>'北马里亚纳群岛',);
Core_Comm_City::$cityConfig['BEN'] = array('name'=>'贝宁','province'=>array(
                ''=>array('name'=>'','city'=>array('AL'=>'阿黎博里','AK'=>'阿塔科拉','LI'=>'滨海','BOH'=>'波希康市','BO'=>'博尔古','AQ'=>'大西洋','PL'=>'高原','KO'=>'库福','MO'=>'莫诺','CO'=>'丘陵','OU'=>'韦梅','DO'=>'峡谷','ZO'=>'祖',)),
));
Core_Comm_City::$cityConfig['BEL'] = array('name'=>'比利时','province'=>array(
                ''=>array('name'=>'','city'=>array('WHT'=>'埃诺','VAN'=>'安特卫普','WBR'=>'布拉班特-瓦隆','BRU'=>'布鲁塞尔','VOV'=>'东佛兰德','VBR'=>'佛兰芒-布拉班特','WLG'=>'列日','VLI'=>'林堡','WLX'=>'卢森堡','WNA'=>'那慕尔','VWV'=>'西佛兰德',)),
));
Core_Comm_City::$cityConfig['ISL'] = array('name'=>'冰岛',);
Core_Comm_City::$cityConfig['PRI'] = array('name'=>'波多黎各',);
Core_Comm_City::$cityConfig['POL'] = array('name'=>'波兰','province'=>array(
                ''=>array('name'=>'','city'=>array('ELB'=>'埃尔布隆格','OLS'=>'奥尔什丁','OSS'=>'奥斯特罗文卡','BZG'=>'比得哥什','PIO'=>'彼得库夫','BYT'=>'比托姆','BAP'=>'比亚瓦波德拉斯卡','BIA'=>'比亚维斯托克','OPO'=>'波莱','POZ'=>'波兹南','DAB'=>'达布罗瓦戈尼察','GOW'=>'大波兰地区戈茹夫','WRO'=>'弗罗茨瓦夫','WLO'=>'弗沃茨瓦韦克','GDN'=>'格但斯克','GDY'=>'格丁尼亚','GWC'=>'格利维采','GRU'=>'格鲁琼兹','CHO'=>'海乌姆','WAW'=>'华沙','CHZ'=>'霍茹夫','KAL'=>'卡利什','KTW'=>'卡托维兹','KLC'=>'凯尔采','KON'=>'科宁','OSZ'=>'科沙林','KRK'=>'克拉科夫','KRO'=>'克罗斯诺','RDM'=>'拉多姆','LEG'=>'莱格尼察','LEZ'=>'莱什诺','LUL'=>'卢布林','RDS'=>'鲁达','LOD'=>'罗兹','IEG'=>'绿山城','MYL'=>'米什洛维采','PIL'=>'皮瓦','PRZ'=>'普热梅希尔','PLO'=>'普沃茨克','CIE'=>'切哈努夫','RZE'=>'热舒夫','SZZ'=>'什切青','SKI'=>'斯凯尔涅维采','SLP'=>'斯武普斯克','SWL'=>'苏瓦乌基','SOP'=>'索波特','SWC'=>'索斯诺维茨','TAR'=>'塔尔努夫','QEP'=>'塔尔诺布热格','TYY'=>'特切','TOR'=>'托伦','WZH'=>'瓦乌布日赫','QOY'=>'沃姆扎','SOW'=>'希米亚诺维采','SWI'=>'希维诺乌伊希切','SWT'=>'希维托赫洛维采','SDC'=>'谢德尔采','SIR'=>'谢拉兹','NOW'=>'新松奇','JAW'=>'雅沃兹诺','JEG'=>'耶莱尼亚古拉','ZAB'=>'扎布热','ZAM'=>'扎莫希奇',)),
));
Core_Comm_City::$cityConfig['BOL'] = array('name'=>'玻利维亚','province'=>array(
                ''=>array('name'=>'','city'=>array('ALT'=>'奥尔托','ORU'=>'奥鲁罗','BEN'=>'贝尼','POI'=>'波多西','QUI'=>'基拉科洛','CBB'=>'科恰班巴','LPB'=>'拉巴斯','PAN'=>'潘多','CHU'=>'丘基萨卡','SAC'=>'萨卡巴','SRZ'=>'圣克鲁斯','TJA'=>'塔里哈',)),
));
Core_Comm_City::$cityConfig['BIH'] = array('name'=>'波斯尼亚和黑塞哥维那','province'=>array(
                ''=>array('name'=>'','city'=>array('FPO'=>'波萨维纳','FBP'=>'波斯尼亚－波德里涅','FTO'=>'多米斯拉夫格勒','FHN'=>'黑塞哥维那－涅雷特瓦','FSA'=>'萨拉热窝','FTU'=>'图兹拉－波德里涅','FUS'=>'乌纳－萨纳','FHB'=>'西波斯尼亚','FZH'=>'西黑塞哥维那','FZE'=>'泽尼察－多博伊','FSB'=>'中波斯尼亚',)),
));
Core_Comm_City::$cityConfig['BWA'] = array('name'=>'博茨瓦纳',);
Core_Comm_City::$cityConfig['BLZ'] = array('name'=>'伯利兹','province'=>array(
                ''=>array('name'=>'','city'=>array('BZ'=>'伯利兹','OW'=>'橘园','CY'=>'卡约','CR'=>'科罗萨尔','SC'=>'斯坦港','TO'=>'托莱多',)),
));
Core_Comm_City::$cityConfig['BTN'] = array('name'=>'不丹',);
Core_Comm_City::$cityConfig['BFA'] = array('name'=>'布基纳法索','province'=>array(
                ''=>array('name'=>'','city'=>array('BAL'=>'巴雷','BAM'=>'巴姆','BAN'=>'巴瓦 ','BAZ'=>'巴泽加','PON'=>'波尼','BLG'=>'布尔古','BOK'=>'布尔基恩德','BOR'=>'布古里巴','GAN'=>'冈祖尔古','GOU'=>'古尔马','ZIR'=>'济罗','KAD'=>'卡焦戈','KEN'=>'凯内杜古','KOO'=>'科蒙加里','COM'=>'科莫埃','KOP'=>'孔皮恩加','KOS'=>'孔西','KOL'=>'库尔佩罗戈','KOW'=>'库尔维奥戈','KOT'=>'库里滕加','LER'=>'雷拉巴','LOR'=>'罗卢姆','MOU'=>'穆翁','NAM'=>'纳门滕加','NAH'=>'纳乌里','NAY'=>'纳亚拉','GNA'=>'尼亚尼亚','NOU'=>'努姆比埃尔','PAS'=>'帕索雷','SEN'=>'塞诺','SAG'=>'桑吉','SAM'=>'桑马滕加','SOR'=>'苏鲁','SOM'=>'苏姆','TAP'=>'塔波阿','TUY'=>'图伊','HOU'=>'乌埃','OUB'=>'乌布里滕加','OUD'=>'乌达兰','SIS'=>'锡西里','YAG'=>'亚加','YAT'=>'亚滕加','IOA'=>'伊奥巴','ZOW'=>'宗德韦奥戈','ZOD'=>'宗多马',)),
));
Core_Comm_City::$cityConfig['BDI'] = array('name'=>'布隆迪','province'=>array(
                ''=>array('name'=>'','city'=>array('BB'=>'布班扎','BR'=>'布鲁里','BM'=>'布琼布拉城市','BU'=>'布琼布拉乡村','NG'=>'恩戈齐','KI'=>'基龙多','GI'=>'基特加','KR'=>'卡鲁济','KY'=>'卡扬扎　 ','CA'=>'坎库佐','RT'=>'鲁塔纳 ','RY'=>'鲁伊吉','MA'=>'马坎巴','MU'=>'穆拉姆维亚','MW'=>'穆瓦洛','MY'=>'穆因加','CI'=>'锡比托凯',)),
));
Core_Comm_City::$cityConfig['BVT'] = array('name'=>'布韦岛',);
Core_Comm_City::$cityConfig['PRK'] = array('name'=>'朝鲜','province'=>array(
                ''=>array('name'=>'','city'=>array('HAE'=>'海州','HYE'=>'惠山','KAN'=>'江界','KSN'=>'开城','NAS'=>'罗先','NAM'=>'南浦','FNJ'=>'平壤','CHO'=>'清津','SAR'=>'沙里院','HAM'=>'咸兴','SII'=>'新义州','WON'=>'元山',)),
));
Core_Comm_City::$cityConfig['DNK'] = array('name'=>'丹麦','province'=>array(
                ''=>array('name'=>'','city'=>array('AR'=>'奥胡斯','VSV'=>'北日德兰','BO'=>'博恩霍尔姆','FRE'=>'菲特烈堡','FY'=>'菲茵','CPH'=>'哥本哈根','RIB'=>'里伯','RKG'=>'灵克宾','RKE'=>'罗斯基勒','VBI'=>'南日德兰','ST'=>'斯多斯特姆','VIB'=>'维堡','VEJ'=>'维厄勒','VS'=>'西希兰',)),
));
Core_Comm_City::$cityConfig['DEU'] = array('name'=>'德国','province'=>array(
                ''=>array('name'=>'','city'=>array('ARN'=>'阿恩斯贝格','ERF'=>'爱尔福特','ANS'=>'安斯巴格','AGB'=>'奥格斯堡','BE'=>'柏林','BYU'=>'拜伊罗特','BFE'=>'比勒费尔德','POT'=>'波茨坦','BOM'=>'波鸿','HB'=>'不来梅','BRW'=>'不伦瑞克','DAR'=>'达姆施塔特','DET'=>'代特莫尔特','DRS'=>'德累斯顿','DES'=>'德绍','DUS'=>'杜塞尔多夫','FFO'=>'法兰克福','FBG'=>'弗赖堡','HAE'=>'哈雷','HH'=>'汉堡','HAJ'=>'汉诺威','KEL'=>'基尔','GBN'=>'吉森','KAE'=>'卡尔斯鲁厄','KAS'=>'卡塞尔','CHE'=>'开姆尼斯','KOB'=>'科布伦次','CGN'=>'科隆','LEJ'=>'莱比锡','LDH'=>'兰茨胡特','LBG'=>'吕讷堡','MAG'=>'马格德堡','MHG'=>'曼海姆','MAI'=>'美因兹','MUN'=>'明斯特','MUC'=>'慕尼黑','NUE'=>'纽伦堡','SWH'=>'什未林','STR'=>'斯图加特','TRI'=>'特里尔','WIB'=>'威斯巴登','WUG'=>'维尔茨堡',)),
));
Core_Comm_City::$cityConfig['TLS'] = array('name'=>'东帝汶','province'=>array(
                ''=>array('name'=>'','city'=>array('AL'=>'阿伊莱乌','AN'=>'阿伊纳罗','ER'=>'埃尔梅拉','AM'=>'安贝诺','BA'=>'包考','BO'=>'博博纳罗','DI'=>'帝力','KO'=>'科瓦利马','LA'=>'劳滕','LI'=>'利基卡','MT'=>'马纳图托','MF'=>'马努法伊','VI'=>'维克克',)),
));
Core_Comm_City::$cityConfig['TGO'] = array('name'=>'多哥','province'=>array(
                ''=>array('name'=>'','city'=>array('M'=>'滨海区','S'=>'草原区','P'=>'高原区','K'=>'卡拉区','C'=>'中部区',)),
));
Core_Comm_City::$cityConfig['DMA'] = array('name'=>'多米尼加',);
Core_Comm_City::$cityConfig['DOM'] = array('name'=>'多米尼加共和国',);
Core_Comm_City::$cityConfig['RUS'] = array('name'=>'俄罗斯','province'=>array(
                ''=>array('name'=>'','city'=>array('ABA'=>'阿巴坎','ARK'=>'阿尔汉格尔斯克','AGI'=>'阿金斯科耶','DYR'=>'阿纳德尔','AST'=>'阿斯特拉罕','ESL'=>'埃利斯塔','ORL'=>'奥廖尔','ORE'=>'奥伦堡','BAX'=>'巴尔瑙尔','PNZ'=>'奔萨','PKC'=>'彼得罗巴甫洛夫斯克','PES'=>'彼得罗扎沃茨克','PER'=>'彼尔姆','BBZ'=>'比罗比詹','BEL'=>'别尔哥罗德','COK'=>'伯力','BQS'=>'布拉戈维申斯克','BRY'=>'布良斯克','CHE'=>'车里雅宾斯克','CHI'=>'赤塔','ROS'=>'顿河畔罗斯托夫','OMS'=>'鄂木斯克','VOG'=>'伏尔加格勒','VMR'=>'弗拉基米尔','VLA'=>'弗拉季高加索','GOA'=>'戈尔诺－阿尔泰斯克','GRV'=>'格罗兹尼','VVO'=>'海参崴','KHM'=>'汉特－曼西斯克','KIR'=>'基洛夫','KGD'=>'加里宁格勒','KZN'=>'喀山','KLF'=>'卡卢加','KOS'=>'科斯特罗马','KRR'=>'克拉斯诺达尔','KYA'=>'克拉斯诺亚尔斯克','KEM'=>'克麦罗沃','KYZ'=>'克孜勒','KUD'=>'库德姆卡尔','KRO'=>'库尔干','URS'=>'库尔斯克','LIP'=>'利佩茨克','RYA'=>'梁赞','MCX'=>'马哈奇卡拉','MAG'=>'马加丹','IN'=>'马加斯','MAY'=>'迈科普','MMK'=>'摩尔曼斯克','MOW'=>'莫斯科','NAL'=>'纳尔奇克','NNM'=>'纳里扬马尔','JSA'=>'南萨哈林斯克','VUS'=>'诺夫哥罗德','PAL'=>'帕拉纳','PSK'=>'普斯科夫','CSY'=>'切博克萨雷','CKS'=>'切尔克斯克','TYU'=>'秋明','SAR'=>'萨拉托夫','SKX'=>'萨兰斯克','SLY'=>'萨列哈尔德','SAM'=>'萨马拉','SCW'=>'瑟克特夫卡尔','SPE'=>'圣彼得堡','LNX'=>'斯摩棱斯克','STA'=>'斯塔夫罗波尔','TAM'=>'坦波夫','TVE'=>'特维尔','TUL'=>'图拉','TOM'=>'托木斯克','VOR'=>'沃罗涅什','VLG'=>'沃洛格达','UFA'=>'乌法','UUD'=>'乌兰乌德','ULY'=>'乌里扬诺夫斯克','UOB'=>'乌斯季奥尔登斯基','GOJ'=>'下诺夫哥罗德','NVS'=>'新西伯利亚','JAK'=>'雅库茨克','JAR'=>'雅罗斯拉夫尔','JEK'=>'叶卡捷林堡','IKT'=>'伊尔库茨克','IJK'=>'伊热夫斯克','IVO'=>'伊万诺沃','YOL'=>'约什卡尔奥拉',)),
));
Core_Comm_City::$cityConfig['ECU'] = array('name'=>'厄瓜多尔','province'=>array(
                ''=>array('name'=>'','city'=>array('A'=>'阿苏艾','O'=>'埃尔奥罗','E'=>'埃斯梅拉尔达斯','B'=>'玻利瓦尔','G'=>'瓜亚斯','W'=>'加拉帕戈斯','C'=>'卡尔奇','F'=>'卡尼亚尔','X'=>'科托帕希','L'=>'洛哈','R'=>'洛斯里奥斯','M'=>'马纳比','S'=>'莫罗纳－圣地亚哥','D'=>'纳波，奥雷利亚纳','Y'=>'帕斯塔萨','P'=>'皮钦查','H'=>'钦博拉索','Z'=>'萨莫拉－钦奇佩','U'=>'苏昆毕奥斯','T'=>'通古拉瓦','I'=>'因巴布拉',)),
));
Core_Comm_City::$cityConfig['ERI'] = array('name'=>'厄立特里亚','province'=>array(
                ''=>array('name'=>'','city'=>array('KE'=>'安塞巴','SK'=>'北红海','BR'=>'加什·巴尔卡','DE'=>'南部','DK'=>'南红海','MA'=>'中部',)),
));
Core_Comm_City::$cityConfig['FRA'] = array('name'=>'法国','province'=>array(
                ''=>array('name'=>'','city'=>array('ARL'=>'阿尔勒','AJA'=>'阿雅克修','QXB'=>'艾克斯','ORR'=>'奥尔良','PAR'=>'巴黎','BSN'=>'贝桑松','DIJ'=>'第戎','FRJ'=>'弗雷瑞斯','CFR'=>'卡昂','RNS'=>'雷恩','LIO'=>'里昂','LLE'=>'里尔','LIG'=>'利摩日','URO'=>'鲁昂','MRS'=>'马赛','MZM'=>'梅斯','MPL'=>'蒙彼利埃','NTE'=>'南特','NCE'=>'尼斯','CSM'=>'沙隆','TLS'=>'图卢兹','VAA'=>'瓦朗斯','AMI'=>'亚眠',)),
));
Core_Comm_City::$cityConfig['FRO'] = array('name'=>'法罗群岛',);
Core_Comm_City::$cityConfig['PYF'] = array('name'=>'法属波利尼西亚',);
Core_Comm_City::$cityConfig['GUF'] = array('name'=>'法属圭亚那',);
Core_Comm_City::$cityConfig['ATF'] = array('name'=>'法属南部领地',);
Core_Comm_City::$cityConfig['VAT'] = array('name'=>'梵蒂冈',);
Core_Comm_City::$cityConfig['PHL'] = array('name'=>'菲律宾','province'=>array(
                ''=>array('name'=>'','city'=>array('DOR'=>'达沃','CAO'=>'卡卢坎','MNL'=>'马尼拉','CEB'=>'宿务',)),
));
Core_Comm_City::$cityConfig['FJI'] = array('name'=>'斐济',);
Core_Comm_City::$cityConfig['FIN'] = array('name'=>'芬兰','province'=>array(
                ''=>array('name'=>'','city'=>array('ESP'=>'埃斯波','OLU'=>'奥卢','POR'=>'波里','PRV'=>'博尔沃','HMY'=>'海门林纳','HEL'=>'赫尔辛基','KAJ'=>'卡亚尼','KOK'=>'科科拉','KTK'=>'科特卡','KUO'=>'库奥皮奥','LHI'=>'拉赫蒂','LPP'=>'拉彭兰塔','RVN'=>'罗瓦涅米','MHQ'=>'玛丽港','MIK'=>'米凯利','TMP'=>'坦佩雷','TKU'=>'图尔库','VAA'=>'瓦萨','VAT'=>'万塔','JOE'=>'约恩苏',)),
));
Core_Comm_City::$cityConfig['CPV'] = array('name'=>'佛得角','province'=>array(
                ''=>array('name'=>'','city'=>array('PA'=>'保尔 ','PN'=>'波多诺伏','BV'=>'博阿维斯塔岛','BR'=>'布拉瓦岛','RG'=>'大里贝拉','FO'=>'福古岛　 ','MA'=>'马尤岛 ','MO'=>'莫斯特罗','PR'=>'普拉亚','SL'=>'萨尔岛','SA'=>'圣安唐岛 　 ','IA'=>'圣地亚哥岛　 ','SD'=>'圣多明戈','SF'=>'圣菲利普','CA'=>'圣卡塔琳娜','CR'=>'圣克鲁斯','SM'=>'圣米戈尔','SN'=>'圣尼古拉岛','SV'=>'圣维森特岛','TA'=>'塔拉法尔',)),
));
Core_Comm_City::$cityConfig['FLK'] = array('name'=>'弗兰克群岛',);
Core_Comm_City::$cityConfig['GMB'] = array('name'=>'冈比亚',);
Core_Comm_City::$cityConfig['COG'] = array('name'=>'刚果',);
Core_Comm_City::$cityConfig['COD'] = array('name'=>'刚果民主共和国',);
Core_Comm_City::$cityConfig['COL'] = array('name'=>'哥伦比亚','province'=>array(
                ''=>array('name'=>'','city'=>array('ARA'=>'阿劳卡','ANT'=>'安提奥基亚','NDS'=>'北桑坦德','BDC'=>'波哥大首都区','BOL'=>'博利瓦尔','BOY'=>'博亚卡','ATL'=>'大西洋','GVR'=>'瓜维亚雷','GJR'=>'瓜希拉','GNA'=>'瓜伊尼亚','QUI'=>'金迪奥','CAL'=>'卡尔达斯','CAQ'=>'卡克塔','CAS'=>'卡萨纳雷','CAU'=>'考卡','VDC'=>'考卡山谷','COR'=>'科尔多巴','CAM'=>'昆迪纳马卡','RIS'=>'利萨拉尔达','MAG'=>'马格达雷那','MET'=>'梅塔','NAR'=>'纳里尼奥','PUT'=>'普图马约','CHO'=>'乔科','CES'=>'塞萨尔','SAN'=>'桑坦德','SAP'=>'圣安德烈斯-普罗维登西亚','SUC'=>'苏克雷','TOL'=>'托利马','VIC'=>'维查达','VAU'=>'沃佩斯','HUI'=>'乌伊拉','AMZ'=>'亚马孙',)),
));
Core_Comm_City::$cityConfig['CRI'] = array('name'=>'哥斯达黎加','province'=>array(
                ''=>array('name'=>'','city'=>array('A'=>'阿拉胡埃拉','H'=>'埃雷迪亚','G'=>'瓜纳卡斯特','C'=>'卡塔戈','L'=>'利蒙','P'=>'蓬塔雷纳斯','SJ'=>'圣何塞',)),
));
Core_Comm_City::$cityConfig['GGY'] = array('name'=>'格恩西岛',);
Core_Comm_City::$cityConfig['GRD'] = array('name'=>'格林纳达',);
Core_Comm_City::$cityConfig['GRL'] = array('name'=>'格陵兰',);
Core_Comm_City::$cityConfig['CUB'] = array('name'=>'古巴','province'=>array(
                ''=>array('name'=>'','city'=>array('11'=>'奥尔金','1'=>'比那尔德里奥','5'=>'比亚克拉拉','12'=>'格拉玛','14'=>'关塔那摩','2'=>'哈瓦那','3'=>'哈瓦那城','9'=>'卡马圭','10'=>'拉斯图纳斯','4'=>'马坦萨斯','MAY'=>'马亚里','MZO'=>'曼萨尼罗','99'=>'青年岛特区','13'=>'圣地亚哥','7'=>'圣斯皮里图斯','6'=>'西恩富戈斯','8'=>'谢戈德阿维拉',)),
));
Core_Comm_City::$cityConfig['GLP'] = array('name'=>'瓜德罗普',);
Core_Comm_City::$cityConfig['GUM'] = array('name'=>'关岛',);
Core_Comm_City::$cityConfig['GUY'] = array('name'=>'圭亚那','province'=>array(
                ''=>array('name'=>'','city'=>array('EW'=>'埃塞奎博群岛-西德梅拉拉','BW'=>'巴里马-瓦伊尼','PM'=>'波默伦-苏佩纳姆','PI'=>'波塔罗-锡帕鲁尼','DM'=>'德梅拉拉-马海卡','EC'=>'东伯比斯-科兰太因','CM'=>'库尤尼-马扎鲁尼','MB'=>'马海卡-伯比斯','UD'=>'上德梅拉拉-伯比斯','UT'=>'上塔库图-上埃塞奎博',)),
));
Core_Comm_City::$cityConfig['KAZ'] = array('name'=>'哈萨克斯坦','province'=>array(
                ''=>array('name'=>'','city'=>array('AYK'=>'阿尔卡累克','AKM'=>'阿克莫拉','AKS'=>'阿克苏','AKT'=>'阿克托别','ALA'=>'阿拉木图','ARY'=>'阿雷斯','AST'=>'阿斯塔纳市','ATY'=>'阿特劳','EKB'=>'埃基巴斯图兹','BXH'=>'巴尔喀什','PAV'=>'巴甫洛达尔','SEV'=>'北哈萨克斯坦','VOS'=>'东哈萨克斯坦','ZYR'=>'济良诺夫斯克','DMB'=>'江布尔','DZH'=>'杰兹卡兹甘','KAR'=>'卡拉干达','KZO'=>'卡拉扎尔','KAP'=>'卡普恰盖','KST'=>'科斯塔奈','KZY'=>'克孜勒奥尔达','KEN'=>'肯套','KUR'=>'库尔恰托夫','LKK'=>'利萨科夫斯克','LEN'=>'列宁诺戈尔斯克','RUD'=>'鲁德内','MAN'=>'曼格斯套','KGT'=>'南哈萨克斯坦','SAR'=>'萨兰','SEM'=>'塞梅伊','SAK'=>'沙赫京斯克','STE'=>'斯捷普诺戈尔斯克','TEK'=>'铁克利','TEM'=>'铁米尔套','TUR'=>'突厥斯坦','ZAP'=>'西哈萨克斯坦','ZHA'=>'扎纳奥津',)),
));
Core_Comm_City::$cityConfig['HTI'] = array('name'=>'海地',);
Core_Comm_City::$cityConfig['KOR'] = array('name'=>'韩国','province'=>array(
                '27'=>array('name'=>'大邱','city'=>array('DSG'=>'达城郡','TAE'=>'大邱','SUS'=>'寿城区',)),
                '30'=>array('name'=>'大田',),
                '26'=>array('name'=>'釜山',),
                '29'=>array('name'=>'光州',),
                '41'=>array('name'=>'济州特别自治道',),
                '42'=>array('name'=>'江原道','city'=>array('CHC'=>'春川市','TGH'=>'东海市','GSG'=>'高城郡','HSG'=>'横城郡','HCN'=>'洪川郡','HCH'=>'华川郡','KAG'=>'江陵市','JSE'=>'旌善郡','IJE'=>'麟蹄郡','YWL'=>'宁越郡','POG'=>'平昌郡','SUK'=>'三陟市','SHO'=>'束草市','TBK'=>'太白市','CWN'=>'铁原郡','YNY'=>'襄阳郡','YGU'=>'杨口郡','WJU'=>'原州市',)),
                '49'=>array('name'=>'京畿道','city'=>array('ASG'=>'安城市','ASN'=>'安山市','ANY'=>'安养市','POC'=>'抱川市','SEO'=>'城南市','DDC'=>'东豆川市','BCN'=>'富川市','GYG'=>'高阳市','GMG'=>'光明市','KWU'=>'广州市','GCN'=>'果川市','HNM'=>'河南市','HCH'=>'华城市','GPG'=>'加平郡','GMP'=>'金浦市','GRI'=>'九里市','GUN'=>'军浦市','YJU'=>'骊州郡','ICE'=>'利川市','YCN'=>'涟川郡','YNG'=>'龙仁市','NYU'=>'南杨州市','PTK'=>'平泽市','PJU'=>'坡州市','SHE'=>'始兴市','SUO'=>'水原市','OSN'=>'乌山市','YPG'=>'扬平郡','YYU'=>'杨州市','UWN'=>'仪旺市','UIJ'=>'议政府市',)),
                '43'=>array('name'=>'庆尚北道','city'=>array('ADG'=>'安东市','BHA'=>'奉化郡','GRG'=>'高灵郡','KUM'=>'龟尾市','KMC'=>'金泉市','GWI'=>'军威郡','YEC'=>'醴泉郡','KPO'=>'浦项市','CGK'=>'漆谷郡','CDO'=>'淸道郡','CSG'=>'靑松郡','GYS'=>'庆山市','GJU'=>'庆州市','YEJ'=>'荣州市','SJU'=>'尙州市','UJN'=>'蔚珍郡','MGG'=>'闻庆市','SEJ'=>'星州郡','USG'=>'义城郡','YYG'=>'英阳郡','YDK'=>'盈德郡','YCH'=>'永川市','ULG'=>'郁陵郡',)),
                '44'=>array('name'=>'庆尚南道','city'=>array('CNG'=>'昌宁郡','CHW'=>'昌原市','GSO'=>'固城郡','HDG'=>'河东郡','KMH'=>'金海市','HIN'=>'晋州市','GCH'=>'居昌郡','KJE'=>'巨济市','YSN'=>'梁山市','MAS'=>'马山市','MIR'=>'密阳市','NHE'=>'南海郡','SCH'=>'山淸郡','SAH'=>'泗川市','TYG'=>'统营市','HCE'=>'陜川郡','HAN'=>'咸安郡','HYG'=>'咸阳郡','URG'=>'宜宁郡','CHF'=>'鎭海市',)),
                '47'=>array('name'=>'全罗北道','city'=>array('SCG'=>'淳昌郡','PUS'=>'扶安郡','GCG'=>'高敞郡','GJE'=>'金堤市','JEO'=>'井邑市','MJU'=>'茂朱郡','NWN'=>'南原市','JNJ'=>'全州市','KUV'=>'群山市','ISL'=>'任实郡','WAJ'=>'完州郡','IKS'=>'益山市','JSU'=>'长水郡','JAN'=>'鎭安郡',)),
                '48'=>array('name'=>'全罗南道','city'=>array('BSG'=>'宝城郡','GHG'=>'高兴郡','GSE'=>'谷城郡','WND'=>'莞岛郡','KAN'=>'光阳市','HAE'=>'海南郡','HSN'=>'和顺郡','GJN'=>'康津郡','YOS'=>'丽水市','YGG'=>'灵光郡','YAM'=>'灵岩郡','NJU'=>'罗州市','MOK'=>'木浦市','GRE'=>'求礼郡','SYS'=>'顺天市','DYA'=>'潭阳郡','MAN'=>'务安郡','HPG'=>'咸平郡','SAN'=>'新安郡','JSN'=>'长城郡','JHG'=>'长兴郡','JDO'=>'珍岛郡',)),
                '28'=>array('name'=>'仁川',),
                '11'=>array('name'=>'首尔',),
                '31'=>array('name'=>'蔚山',),
                '45'=>array('name'=>'忠清北道','city'=>array('BEN'=>'报恩郡','JYG'=>'曾坪郡','DYG'=>'丹阳郡','JCH'=>'堤川市','GSN'=>'槐山郡','CWO'=>'淸原郡','CJJ'=>'淸州市','OCN'=>'沃川郡','ESG'=>'阴城郡','YDG'=>'永同郡','JCN'=>'鎭川郡','CHU'=>'忠州市',)),
                '46'=>array('name'=>'忠清南道','city'=>array('BOR'=>'保宁市','BYO'=>'扶余郡','GOJ'=>'公州市','HSE'=>'洪城郡','GYE'=>'鸡龙市','GSA'=>'锦山郡','YOS'=>'礼山郡','NSN'=>'论山市','CYG'=>'青阳郡','SSA'=>'瑞山市','SCE'=>'舒川郡','TAN'=>'泰安郡','TJI'=>'唐津郡','CHO'=>'天安市','ASA'=>'牙山市','YGI'=>'燕岐郡',)),
));
Core_Comm_City::$cityConfig['NLD'] = array('name'=>'荷兰','province'=>array(
                ''=>array('name'=>'','city'=>array('AER'=>'阿尔梅勒','AME'=>'阿默斯福特','AMS'=>'阿姆斯特丹','ARN'=>'阿纳姆','APE'=>'阿珀尔多伦','ASS'=>'阿森','EDE'=>'埃德','EMM'=>'埃门','EIN'=>'埃因霍芬','BRD'=>'布雷达','TLB'=>'蒂尔堡','DOR'=>'多德雷赫特','ENS'=>'恩斯赫德','GRQ'=>'格罗宁根','HRA'=>'哈勒姆','HAG'=>'海牙','HFD'=>'霍夫多尔普','LID'=>'莱顿','LEY'=>'莱利斯塔德','RTM'=>'鹿特丹','LWR'=>'吕伐登','MST'=>'马斯特里赫特','MDL'=>'米德尔堡','NIJ'=>'奈梅亨','HTB'=>'斯海尔托亨博思','UTC'=>'乌得勒支','ZWO'=>'兹沃勒','ZTM'=>'佐特尔梅',)),
));
Core_Comm_City::$cityConfig['ANT'] = array('name'=>'荷属安地列斯',);
Core_Comm_City::$cityConfig['HMD'] = array('name'=>'赫德和麦克唐纳群岛',);
Core_Comm_City::$cityConfig['HND'] = array('name'=>'洪都拉斯','province'=>array(
                ''=>array('name'=>'','city'=>array('AT'=>'阿特兰蒂达','PA'=>'埃尔帕拉伊索','OC'=>'奥科特佩克','OL'=>'奥兰乔','FM'=>'弗朗西斯科-莫拉桑','GD'=>'格拉西亚斯-阿迪奥斯','IB'=>'海湾群岛','CR'=>'科尔特斯','CL'=>'科隆','CM'=>'科马亚瓜','CP'=>'科潘','PZ'=>'拉巴斯','LE'=>'伦皮拉','CH'=>'乔卢特卡','CHO'=>'乔罗马','VA'=>'山谷','SB'=>'圣巴巴拉','IN'=>'因蒂布卡','YO'=>'约罗',)),
));
Core_Comm_City::$cityConfig['KIR'] = array('name'=>'基里巴斯','province'=>array(
                ''=>array('name'=>'','city'=>array('PHO'=>'菲尼克斯群岛','GIL'=>'吉尔伯特群岛','LIN'=>'莱恩群岛',)),
));
Core_Comm_City::$cityConfig['DJI'] = array('name'=>'吉布提','province'=>array(
                ''=>array('name'=>'','city'=>array('S'=>'阿里萨比赫区','O'=>'奥博克区','K'=>'迪基勒区','T'=>'塔朱拉区',)),
));
Core_Comm_City::$cityConfig['KGZ'] = array('name'=>'吉尔吉斯斯坦','province'=>array(
                ''=>array('name'=>'','city'=>array('O'=>'奥什','B'=>'巴特肯','GB'=>'比什凯克市','C'=>'楚河','J'=>'贾拉拉巴德','KBA'=>'卡拉巴尔塔','KKO'=>'卡拉库尔','KAN'=>'坎特','KJ'=>'科克扬加克','MS'=>'迈利赛','N'=>'纳伦','SU'=>'苏卢克图','T'=>'塔拉斯','TK'=>'塔什库梅尔','UG'=>'乌兹根','Y'=>'伊塞克湖',)),
));
Core_Comm_City::$cityConfig['GIN'] = array('name'=>'几内亚','province'=>array(
                ''=>array('name'=>'','city'=>array('BOK'=>'博凯','NZR'=>'恩泽雷科雷','FRN'=>'法拉纳','KND'=>'金迪亚','KNK'=>'康康','CNK'=>'科纳克里','LAB'=>'拉贝','MAM'=>'玛木',)),
));
Core_Comm_City::$cityConfig['GNB'] = array('name'=>'几内亚比绍',);
Core_Comm_City::$cityConfig['CAN'] = array('name'=>'加拿大','province'=>array(
                ''=>array('name'=>'','city'=>array('ABB'=>'阿伯茨福','EDM'=>'埃德蒙顿','OSH'=>'奥沙瓦','BAR'=>'巴里','CBR'=>'布列塔尼角','TOR'=>'多伦多','FRE'=>'弗雷德里顿','GLP'=>'圭尔夫','HAL'=>'哈利法克斯','HAM'=>'哈密尔顿','YXY'=>'怀特霍斯','KWL'=>'基劳纳','BRP'=>'基奇纳','KGN'=>'金斯敦','CAL'=>'卡里加里','QUE'=>'魁北克','REG'=>'里贾纳','LOD'=>'伦敦','MTR'=>'蒙特利尔','SUD'=>'萨德伯里','SAK'=>'萨斯卡通','TRR'=>'三河城','THU'=>'桑德贝','SBE'=>'舍布鲁克','SCA'=>'圣卡塔琳娜','SJB'=>'圣约翰斯','VIC'=>'维多利亚','VAN'=>'温哥华','WNP'=>'温尼伯','WDR'=>'温莎','OTT'=>'渥太华','CHA'=>'夏洛特敦','YZF'=>'耶洛奈夫','IQL'=>'伊魁特',)),
));
Core_Comm_City::$cityConfig['GHA'] = array('name'=>'加纳','province'=>array(
                ''=>array('name'=>'','city'=>array('AS'=>'阿散蒂','OBU'=>'奥布阿西','NO'=>'北部','BA'=>'布朗阿哈福','GA'=>'大阿克拉','EA'=>'东部','UE'=>'上东部','UW'=>'上西部','VO'=>'沃尔特','WE'=>'西部','CE'=>'中部',)),
));
Core_Comm_City::$cityConfig['GAB'] = array('name'=>'加蓬','province'=>array(
                ''=>array('name'=>'','city'=>array('OL'=>'奥果韦-洛洛','OI'=>'奥果韦-伊温多','OM'=>'滨海奥果韦','NG'=>'恩古涅','ES'=>'河口','NY'=>'尼扬加','HO'=>'上奥果韦','WN'=>'沃勒-恩特姆','MO'=>'中奥果韦',)),
));
Core_Comm_City::$cityConfig['KHM'] = array('name'=>'柬埔寨','province'=>array(
                ''=>array('name'=>'','city'=>array('OC'=>'奥多棉吉','KB'=>'白马市','PR'=>'柏威夏','PL'=>'拜林市','BM'=>'班迭棉吉','KZC'=>'磅清扬','KO'=>'磅士卑','KZK'=>'磅同','KM'=>'磅湛','PG'=>'波罗勉','TK'=>'茶胶','SVR'=>'柴桢','KL'=>'干丹','KKZ'=>'戈公','KMT'=>'贡布','PNH'=>'金边市','KH'=>'桔井','RBE'=>'腊塔纳基里','BA'=>'马德望','MWV'=>'蒙多基里','PO'=>'菩萨','TNX'=>'上丁','KA'=>'西哈努克市','REP'=>'暹粒',)),
));
Core_Comm_City::$cityConfig['CZE'] = array('name'=>'捷克共和国','province'=>array(
                ''=>array('name'=>'','city'=>array('OL'=>'奥洛穆茨','PL'=>'比尔森','PR'=>'布拉格直辖市','KR'=>'赫拉德茨-克拉洛韦','KA'=>'卡罗维发利','LI'=>'利贝雷克','MO'=>'摩拉维亚-西里西亚 ','JC'=>'南摩拉维亚  ','PA'=>'帕尔杜比采','VY'=>'维索基纳','US'=>'乌斯季','ST'=>'中捷克','ZL'=>'兹林',)),
));
Core_Comm_City::$cityConfig['ZWE'] = array('name'=>'津巴布韦','province'=>array(
                ''=>array('name'=>'','city'=>array('MN'=>'北马塔贝莱兰','BU'=>'布拉瓦约','ME'=>'东马绍纳兰','HA'=>'哈拉雷','ML'=>'马尼卡兰','MV'=>'马斯温戈','MS'=>'南马塔贝莱兰','MW'=>'西马绍纳兰','MD'=>'中部','MC'=>'中马绍纳兰',)),
));
Core_Comm_City::$cityConfig['CMR'] = array('name'=>'喀麦隆','province'=>array(
                ''=>array('name'=>'','city'=>array('ADA'=>'阿达马瓦','NOR'=>'北部','EXN'=>'北端','LIT'=>'滨海','EST'=>'东部','SUD'=>'南部','NOT'=>'西北','OUE'=>'西部','SOU'=>'西南','CEN'=>'中央',)),
));
Core_Comm_City::$cityConfig['QAT'] = array('name'=>'卡塔尔','province'=>array(
                ''=>array('name'=>'','city'=>array('MS'=>'北部','DW'=>'多哈','GW'=>'古韦里耶','KR'=>'豪尔','JB'=>'杰里扬拜特奈','RN'=>'赖扬','WK'=>'沃克拉','UL'=>'乌姆锡拉勒','JM'=>'朱迈利耶',)),
));
Core_Comm_City::$cityConfig['CYM'] = array('name'=>'开曼群岛',);
Core_Comm_City::$cityConfig['CCK'] = array('name'=>'科科斯群岛',);
Core_Comm_City::$cityConfig['COM'] = array('name'=>'科摩罗',);
Core_Comm_City::$cityConfig['CIV'] = array('name'=>'科特迪瓦','province'=>array(
                ''=>array('name'=>'','city'=>array('AG'=>'阿涅比','BF'=>'巴芬','VB'=>'邦达马河谷','DE'=>'登盖莱','NC'=>'恩济－科莫埃','FR'=>'弗罗马格尔','LC'=>'湖泊','MR'=>'马拉韦','SB'=>'南邦达马','SC'=>'南科莫埃','HT'=>'萨桑德拉','SV'=>'萨瓦纳','DH'=>'山地','WR'=>'沃罗杜古','BS'=>'下萨桑德拉','LG'=>'泻湖','ZA'=>'赞赞','MV'=>'中卡瓦利','MC'=>'中科莫埃',)),
));
Core_Comm_City::$cityConfig['KWT'] = array('name'=>'科威特',);
Core_Comm_City::$cityConfig['HRV'] = array('name'=>'克罗地亚','province'=>array(
                ''=>array('name'=>'','city'=>array('14'=>'奥西耶克-巴拉尼亚','7'=>'别洛瓦尔-比洛戈拉','8'=>'滨海和山区','11'=>'波热加-斯拉沃尼亚','12'=>'布罗德-波萨维纳','19'=>'杜布罗夫斯克-内雷特瓦','4'=>'卡尔洛瓦茨','6'=>'科普里夫尼察-克里热夫齐','2'=>'克拉皮纳-扎戈列','9'=>'利卡-塞尼','20'=>'梅吉穆列','1'=>'萨格勒布','21'=>'萨格勒布市','17'=>'斯普利特-达尔马提亚','5'=>'瓦拉日丁','10'=>'维罗维蒂察-波德拉维纳','16'=>'武科瓦尔-斯里耶姆','15'=>'希贝尼克-克宁','3'=>'锡萨克-莫斯拉维纳','18'=>'伊斯特拉','13'=>'扎达尔',)),
));
Core_Comm_City::$cityConfig['KEN'] = array('name'=>'肯尼亚','province'=>array(
                ''=>array('name'=>'','city'=>array('EMA'=>'埃尔格约-马拉奎特','BAR'=>'巴林戈','BUN'=>'邦戈马','BOM'=>'博美特','BUS'=>'布希亚','EMB'=>'恩布','HOB'=>'霍马湾','KIA'=>'基安布','KIL'=>'基里菲','KIR'=>'基里尼亚加','KIS'=>'基苏木','KIT'=>'基图伊','KII'=>'基西','GAS'=>'加里萨','KAK'=>'卡卡梅加','KAJ'=>'卡耶亚多','KEY'=>'凯里乔','KWA'=>'夸勒','LAU'=>'拉木','LAI'=>'莱基皮亚','MAC'=>'马查科斯','MAK'=>'马瓜尼','RBT'=>'马萨布布','MAN'=>'曼德拉','MER'=>'梅鲁','MOM'=>'蒙巴萨','MIG'=>'米戈利','MUR'=>'穆兰卡','NUU'=>'纳库鲁','NAR'=>'纳罗克','NAN'=>'南迪','NA'=>'内罗毕','NIT'=>'尼蒂','NYM'=>'尼亚米拉','NYN'=>'年达鲁阿','NYE'=>'涅里','UAS'=>'桑布卢','TRI'=>'塔纳河','TTA'=>'泰塔塔维塔','TNZ'=>'特兰斯-恩佐亚','TUR'=>'图尔卡纳','WJR'=>'瓦吉尔','UGI'=>'瓦辛基苏','VIH'=>'韦希加','WPO'=>'西波克特','SIA'=>'夏亚','ISI'=>'伊希约洛','CE'=>'中央',)),
));
Core_Comm_City::$cityConfig['COK'] = array('name'=>'库克群岛',);
Core_Comm_City::$cityConfig['LVA'] = array('name'=>'拉脱维亚','province'=>array(
                ''=>array('name'=>'','city'=>array('ALU'=>'阿卢克斯内','AIZ'=>'爱兹克劳克雷','OGR'=>'奥格雷','BAL'=>'巴尔维','BAU'=>'包斯卡','CES'=>'采西斯','DOB'=>'多贝莱','GUL'=>'古尔贝内','JEK'=>'杰卡布皮尔斯','KRA'=>'克拉斯拉瓦 ','KUL'=>'库尔迪加','RZR'=>'雷泽克内','RGA'=>'里加','LPK'=>'利耶帕亚','LIM'=>'林巴济','LUD'=>'卢扎','MAD'=>'马多纳','PRE'=>'普雷利','SAL'=>'萨尔杜斯','TAL'=>'塔尔西','DGR'=>'陶格夫皮尔斯','TUK'=>'图库马','VLK'=>'瓦尔加','VLM'=>'瓦尔米耶拉','VSL'=>'文茨皮尔斯','JGR'=>'叶尔加瓦',)),
));
Core_Comm_City::$cityConfig['LSO'] = array('name'=>'莱索托','province'=>array(
                ''=>array('name'=>'','city'=>array('D'=>'伯里亚','B'=>'布塔布泰','G'=>'古廷','H'=>'加查斯内克','C'=>'莱里贝','E'=>'马费滕','A'=>'马塞卢','F'=>'莫哈莱斯胡克','J'=>'莫霍特隆','K'=>'塔巴采卡',)),
));
Core_Comm_City::$cityConfig['LAO'] = array('name'=>'老挝','province'=>array(
                ''=>array('name'=>'','city'=>array('AT'=>'阿速坡','BL'=>'波里坎赛','BK'=>'博乔','XI'=>'川圹','PH'=>'丰沙里','KH'=>'甘蒙','HO'=>'华潘','LP'=>'琅勃拉邦','LM'=>'琅南塔','XN'=>'赛宋本行政特区','XE'=>'色贡','SL'=>'沙拉湾','SV'=>'沙湾拿吉','XA'=>'沙耶武里','VI'=>'万象','OU'=>'乌多姆赛','CH'=>'占巴塞',)),
));
Core_Comm_City::$cityConfig['LBN'] = array('name'=>'黎巴嫩','province'=>array(
                ''=>array('name'=>'','city'=>array('AS'=>'北部','BI'=>'贝卡','BA'=>'贝鲁特','JL'=>'黎巴嫩山','NA'=>'奈拜提耶市','JA'=>'南部',)),
));
Core_Comm_City::$cityConfig['LBR'] = array('name'=>'利比里亚','province'=>array(
                ''=>array('name'=>'','city'=>array('GBA'=>'巴波卢','BG'=>'邦','BOP'=>'博波卢','BM'=>'博米','GB'=>'大巴萨','GG'=>'大吉德','CM'=>'大角山','GK'=>'大克鲁','FT'=>'菲什敦','RG'=>'吉河','RI'=>'里弗塞斯','LO'=>'洛法','MG'=>'马吉比','MY'=>'马里兰','MO'=>'蒙特塞拉多','NI'=>'宁巴','SI'=>'锡诺',)),
));
Core_Comm_City::$cityConfig['LBY'] = array('name'=>'利比亚',);
Core_Comm_City::$cityConfig['LTU'] = array('name'=>'立陶宛','province'=>array(
                ''=>array('name'=>'','city'=>array('AL'=>'阿利图斯','KA'=>'考纳斯','KL'=>'克莱佩达','MA'=>'马里扬泊列','PA'=>'帕涅韦日斯','TA'=>'陶拉格','TE'=>'特尔希艾','VI'=>'维尔纽斯','UT'=>'乌田纳','SI'=>'希奥利艾','AKM'=>'亚克曼',)),
));
Core_Comm_City::$cityConfig['LIE'] = array('name'=>'列支敦士登',);
Core_Comm_City::$cityConfig['REU'] = array('name'=>'留尼旺岛',);
Core_Comm_City::$cityConfig['LUX'] = array('name'=>'卢森堡','province'=>array(
                ''=>array('name'=>'','city'=>array('DD'=>'迪基希','GG'=>'格雷文马赫','LL'=>'卢森堡',)),
));
Core_Comm_City::$cityConfig['RWA'] = array('name'=>'卢旺达','province'=>array(
                ''=>array('name'=>'','city'=>array('BY'=>'比温巴','BU'=>'布塔雷','NY'=>'恩延扎','KG'=>'基本古','KY'=>'基布耶','KR'=>'基加利-恩加利','KV'=>'基加利市　 ','GK'=>'吉孔戈罗','GS'=>'吉塞尼','GT'=>'吉塔拉马','KA'=>'卡布加','RW'=>'卢瓦马加纳','RH'=>'鲁汉戈','RU'=>'鲁亨盖里','CY'=>'尚古古','UM'=>'乌姆塔拉',)),
));
Core_Comm_City::$cityConfig['ROU'] = array('name'=>'罗马尼亚','province'=>array(
                ''=>array('name'=>'','city'=>array('AL'=>'阿尔巴尤利亚','AR'=>'阿拉德','OR'=>'奥拉迪亚','BA'=>'巴克乌','BM'=>'巴亚马雷','BN'=>'比斯特里察','BO'=>'博托沙尼','BC'=>'布加勒斯特','BS'=>'布拉索夫','BL'=>'布勒伊拉','BZ'=>'布泽乌','DT'=>'德罗贝塔-塞维林堡','DE'=>'德瓦','TI'=>'蒂米什瓦拉','FO'=>'福克沙尼','GL'=>'加拉茨','GG'=>'久尔久','CT'=>'康斯坦察','DO'=>'克拉约瓦','CR'=>'克勒拉希','CN'=>'克卢日纳波卡','VI'=>'勒姆尼库沃尔恰','RE'=>'雷希察','MC'=>'梅尔库里亚丘克','PI'=>'皮特什蒂','PN'=>'皮亚特拉尼亚姆茨','PL'=>'普洛耶什蒂','SM'=>'萨图·马雷','SG'=>'圣格奥尔基','ST'=>'斯拉蒂纳','SB'=>'斯洛博齐亚','SU'=>'苏恰瓦','TA'=>'特尔戈维什泰','TM'=>'特尔古穆列什','TJ'=>'特尔古日乌','TU'=>'图尔恰','VA'=>'瓦斯卢伊','SO'=>'锡比乌','IS'=>'雅西','AD'=>'亚厉山德里亚','ZA'=>'扎勒乌',)),
));
Core_Comm_City::$cityConfig['MDG'] = array('name'=>'马达加斯加','province'=>array(
                ''=>array('name'=>'','city'=>array('AS'=>'安齐拉纳纳 ','FN'=>'菲亚纳兰楚阿 ','MJ'=>'马哈赞加 ','AN'=>'塔那那利佛 ','TM'=>'图阿马西拉 ','TL'=>'图利亚拉 ',)),
));
Core_Comm_City::$cityConfig['MDV'] = array('name'=>'马尔代夫','province'=>array(
                ''=>array('name'=>'','city'=>array('ADD'=>'阿杜','AAD'=>'北阿里','THD'=>'北蒂拉杜马蒂','MAD'=>'北马洛斯马杜卢','MLD'=>'北米拉杜马杜卢','NAD'=>'北尼兰杜','HAD'=>'北苏瓦迪瓦','FAA'=>'法迪福卢','FEA'=>'费利杜','FMU'=>'福阿穆拉库','HDH'=>'哈杜马蒂','KLH'=>'科卢马杜卢','MAL'=>'马累','MAA'=>'马累岛','MUA'=>'穆拉库','AAU'=>'南阿里','THU'=>'南蒂拉杜马蒂','MAU'=>'南马洛斯马杜卢','MLU'=>'南米拉杜马杜卢','NAU'=>'南尼兰杜','HAU'=>'南苏瓦迪瓦',)),
));
Core_Comm_City::$cityConfig['MLT'] = array('name'=>'马耳他',);
Core_Comm_City::$cityConfig['MWI'] = array('name'=>'马拉维','province'=>array(
                ''=>array('name'=>'','city'=>array('N'=>'北部区','S'=>'南部区','C'=>'中央区',)),
));
Core_Comm_City::$cityConfig['MYS'] = array('name'=>'马来西亚','province'=>array(
                'PH'=>array('name'=>'槟榔屿','city'=>array('BWH'=>'北海','PEN'=>'槟城','BMJ'=>'大山脚','NTE'=>'高渊',)),
                'PS'=>array('name'=>'玻璃市 　 　 ','city'=>array('KGR'=>'加央',)),
                'TR'=>array('name'=>'丁加奴','city'=>array('KEM'=>'甘马挽','TGG'=>'瓜拉丁加奴','DGN'=>'龙运','MAR'=>'马江','SET'=>'实兆','HUL'=>'乌鲁','BES'=>'勿述',)),
                'KD'=>array('name'=>'吉打','city'=>array('PGT'=>'巴东得腊','PEN'=>'笨筒','LGK'=>'浮罗交怡','KOR'=>'哥打士打','KPA'=>'古邦巴素','KMU'=>'瓜拉姆达','BLZ'=>'华玲','KLM'=>'居林','BMA'=>'万拉峇鲁',)),
                'KN'=>array('name'=>'吉兰丹','city'=>array('PPU'=>'巴西富地','PMA'=>'巴西马','TMR'=>'丹那美拉','TUM'=>'道北','BAC'=>'登卓','KBR'=>'哥打巴鲁','KUG'=>'瓜拉吉赖','GMU'=>'话望生','MAC'=>'马樟','JEL'=>'日里',)),
                'KL'=>array('name'=>'吉隆坡','city'=>array('KUL'=>'吉隆坡',)),
                'ML'=>array('name'=>'马六甲','city'=>array('MEL'=>'马六甲市','AOG'=>'亚罗牙也','JAS'=>'野新',)),
                'LB'=>array('name'=>'纳闽','city'=>array('LBU'=>'纳闽','VIC'=>'维多利亚',)),
                'PG'=>array('name'=>'彭亨','city'=>array('BER'=>'百乐','PEK'=>'北根','TEM'=>'淡马鲁','JER'=>'而连突','KUA'=>'关丹','CAH'=>'金马仑高原','RAU'=>'劳勿','KUL'=>'立卑','MAR'=>'马兰','BEN'=>'文冬','TOM'=>'云冰',)),
                'PK'=>array('name'=>'霹雳','city'=>array('TAS'=>'安顺','TAM'=>'丹绒马','SSP'=>'和丰','LUM'=>'紅土坎','BGA'=>'华都牙也','KAR'=>'江沙','TPG'=>'太平','IPH'=>'怡保',)),
                'JH'=>array('name'=>'柔佛','city'=>array('POW'=>'笨珍','MEP'=>'丰盛港','KTI'=>'哥打丁宜','KLA'=>'居銮','BAT'=>'峇株巴辖','MUA'=>'麻坡','SGM'=>'昔加末','JHB'=>'新山',)),
                'NS'=>array('name'=>'森美兰','city'=>array('PDI'=>'波德申','TAI'=>'淡边','SRB'=>'芙蓉','KPI'=>'瓜拉庇劳','REM'=>'林茂','JEP'=>'仁保','JEL'=>'日叻务',)),
                'SB'=>array('name'=>'沙巴','city'=>array('PAP'=>'吧巴','BEF'=>'保佛','BEL'=>'比鲁兰','PIT'=>'必达士','PMP'=>'兵南邦','TAB'=>'担布南','TEN'=>'丹南','TAW'=>'斗湖','TUR'=>'斗亚兰','BKI'=>'哥打基纳巴鲁','KMU'=>'哥打马鲁都','KEG'=>'根地咬','KUD'=>'古达','KBD'=>'古打毛律','KUN'=>'古纳','KPU'=>'瓜拉班尤','KBT'=>'京那巴登岸','RNU'=>'兰脑','LDU'=>'拿笃','NAB'=>'纳巴湾','SDK'=>'山打根','SPT'=>'西比陶','SMM'=>'仙本那',)),
                'SR'=>array('name'=>'沙捞越','city'=>array('KCH'=>'古晋','KPI'=>'加帛','LMN'=>'林梦','MYY'=>'美里','BTU'=>'民都鲁','MKM'=>'木胶','BTG'=>'木中','SMH'=>'三马拉汉','SAM'=>'斯里阿曼','SAR'=>'泗里街','SBW'=>'泗务',)),
                'SL'=>array('name'=>'雪兰莪','city'=>array('PJA'=>'八打灵','GOM'=>'鹅麦','KLG'=>'瓜拉冷岳','KSL'=>'瓜拉雪兰莪','SBM'=>'沙白安南','HUL'=>'乌鲁冷岳','HUS'=>'乌鲁雪兰莪','SEP'=>'雪邦',)),
));
Core_Comm_City::$cityConfig['MLI'] = array('name'=>'马里','province'=>array(
                ''=>array('name'=>'','city'=>array('CD'=>'巴马科首都区','KD'=>'基达尔','GA'=>'加奥','KY'=>'卡伊','KL'=>'库利科罗','MP'=>'莫普提','SG'=>'塞古','TB'=>'通布图','SK'=>'锡卡索',)),
));
Core_Comm_City::$cityConfig['MKD'] = array('name'=>'马其顿',);
Core_Comm_City::$cityConfig['MHL'] = array('name'=>'马绍尔群岛',);
Core_Comm_City::$cityConfig['MTQ'] = array('name'=>'马提尼克',);
Core_Comm_City::$cityConfig['MYT'] = array('name'=>'马约特岛',);
Core_Comm_City::$cityConfig['IMN'] = array('name'=>'曼岛',);
Core_Comm_City::$cityConfig['MUS'] = array('name'=>'毛里求斯',);
Core_Comm_City::$cityConfig['MRT'] = array('name'=>'毛里塔尼亚','province'=>array(
                ''=>array('name'=>'','city'=>array('AD'=>'阿德拉尔','AS'=>'阿萨巴','BR'=>'卜拉克纳','HG'=>'东胡德','GO'=>'戈尔戈勒','GM'=>'吉迪马卡','DN'=>'努瓦迪布湾','NO'=>'努瓦克肖特特区','TA'=>'塔甘特','TR'=>'特拉扎','TZ'=>'提里斯-宰穆尔','HC'=>'西胡德','IN'=>'因希里',)),
));
Core_Comm_City::$cityConfig['USA'] = array('name'=>'美国','province'=>array(
                'AR'=>array('name'=>'阿肯色','city'=>array('FYV'=>'费耶特维尔','FSM'=>'史密斯堡','LIT'=>'小石城',)),
                'AL'=>array('name'=>'阿拉巴马','city'=>array('BHM'=>'伯明罕','MGM'=>'蒙哥马利','MOB'=>'莫比尔',)),
                'AK'=>array('name'=>'阿拉斯加','city'=>array('ANC'=>'安克雷奇','FAI'=>'费尔班克斯','JNU'=>'朱诺',)),
                'ID'=>array('name'=>'爱达荷','city'=>array('IDA'=>'爱达荷福尔斯','PIH'=>'波卡特洛','BOI'=>'博伊西','BLK'=>'布莱克富特','COE'=>'科达伦','LWS'=>'刘易斯顿','MJL'=>'莫斯科','ZMU'=>'墨菲','NPA'=>'楠帕','QKM'=>'岂彻姆','SVY'=>'森瓦利','YAF'=>'亚美利加瀑布城',)),
                'IA'=>array('name'=>'爱荷华','city'=>array('DVN'=>'达文波特','DSM'=>'得梅因','CID'=>'锡达拉皮兹',)),
                'ND'=>array('name'=>'北达科他','city'=>array('BIS'=>'俾斯麦','GFK'=>'大福克斯','FAR'=>'法戈','MOT'=>'迈诺特',)),
                'NC'=>array('name'=>'北卡罗来纳','city'=>array('AEV'=>'艾许维尔','DHH'=>'杜罕','GBO'=>'格林斯伯勒','CHE'=>'教堂山','RAG'=>'罗利','RDU'=>'洛利杜罕都会区','CRQ'=>'夏洛特',)),
                'PA'=>array('name'=>'宾夕法尼亚','city'=>array('AEW'=>'阿伦敦','PHL'=>'费城','PIT'=>'匹兹堡',)),
                'TX'=>array('name'=>'德克萨斯','city'=>array('ELP'=>'埃尔帕索','AUS'=>'奥斯汀','DAL'=>'达拉斯','CRP'=>'哥帕斯基斯蒂','GLS'=>'交维斯顿','LRD'=>'拉雷多','TXC'=>'麦亚伦','SAT'=>'圣安东尼奥','HOU'=>'休斯敦',)),
                'OH'=>array('name'=>'俄亥俄','city'=>array('DYT'=>'代顿','CZX'=>'哥伦布','CLE'=>'克利夫兰','TOL'=>'托莱多','CVG'=>'辛辛那提',)),
                'OK'=>array('name'=>'俄克拉荷马','city'=>array('OKC'=>'俄克拉荷马城','OUN'=>'诺曼','TUL'=>'塔尔萨',)),
                'OR'=>array('name'=>'俄勒冈','city'=>array('BZO'=>'本德','PDX'=>'波特兰','DLS'=>'达尔斯','DAC'=>'达拉斯','TLM'=>'蒂拉穆克','XFX'=>'格兰茨帕斯','HDX'=>'胡德里弗','CTR'=>'火山口湖','YCV'=>'科瓦利斯','COB'=>'库斯贝','MFR'=>'梅德福','SLE'=>'塞勒姆','STH'=>'圣海伦斯','SPY'=>'斯普林菲尔德','EUG'=>'尤金',)),
                'FL'=>array('name'=>'佛罗里达','city'=>array('ORL'=>'奥兰多','EYW'=>'基韦斯特','JAX'=>'杰克逊维尔','CPV'=>'卡纳维尔角','FLL'=>'罗德岱堡','MIA'=>'迈阿密','PIE'=>'圣彼德斯堡市','TLH'=>'塔拉哈西','TPA'=>'坦帕',)),
                'VT'=>array('name'=>'佛蒙特','city'=>array('BTV'=>'伯灵顿','RUT'=>'拉特兰','ZBR'=>'南伯灵顿',)),
                'DC'=>array('name'=>'哥伦比亚特区','city'=>array('WAS'=>'华盛顿哥伦比亚特区',)),
                'WA'=>array('name'=>'华盛顿','city'=>array('GEG'=>'斯波坎','TTW'=>'塔科马','SEA'=>'西雅图',)),
                'WY'=>array('name'=>'怀俄明','city'=>array('EVD'=>'埃文斯顿','CPR'=>'卡斯珀','LAR'=>'拉勒米','RKS'=>'罗克斯普林斯','CYS'=>'夏延','SHR'=>'谢里登',)),
                'CA'=>array('name'=>'加利福尼亚','city'=>array('SFO'=>'旧金山','LAX'=>'洛杉矶','SAN'=>'圣迭戈','SJC'=>'圣何塞',)),
                'KS'=>array('name'=>'堪萨斯','city'=>array('ABZ'=>'阿比林','OVL'=>'奥弗兰公园','HCH'=>'哈钦森','KCK'=>'堪萨斯城','XIA'=>'莱文沃思','LWC'=>'劳伦斯','MHK'=>'曼哈顿','TOP'=>'托皮卡','ICT'=>'威奇托',)),
                'CT'=>array('name'=>'康涅狄格','city'=>array('BDR'=>'布里奇波特','DAQ'=>'达里恩','GRH'=>'格林尼治','HFD'=>'哈特福德','XIN'=>'米德尔顿','HVN'=>'纽黑文','WPT'=>'韦斯特波特','WAT'=>'沃特伯里','NWT'=>'新不列颠',)),
                'CO'=>array('name'=>'科罗拉多','city'=>array('ASE'=>'阿斯彭','AUX'=>'奥罗拉','WBU'=>'博尔德','GJT'=>'大章克申','DEN'=>'丹佛','FNL'=>'柯林斯堡','COS'=>'科罗拉多斯普林斯','VAC'=>'韦尔',)),
                'KY'=>array('name'=>'肯塔基','city'=>array('LEX'=>'列克星敦','LUI'=>'路易斯维尔','OWB'=>'欧文斯伯勒',)),
                'LA'=>array('name'=>'路易斯安那','city'=>array('BTR'=>'巴吞鲁日','SHV'=>'什里夫波特','MSY'=>'新奥尔良',)),
                'RI'=>array('name'=>'罗德岛','city'=>array('PAW'=>'波塔基特','CQH'=>'克兰斯顿','NPO'=>'纽波特','PVD'=>'普罗维登斯','WST'=>'韦斯特利','SFN'=>'文索基特','UZO'=>'沃威克',)),
                'MD'=>array('name'=>'马里兰','city'=>array('BAL'=>'巴尔的摩','GAI'=>'盖瑟斯堡','RKV'=>'罗克维尔',)),
                'MA'=>array('name'=>'马萨诸塞','city'=>array('BZD'=>'波士顿','SFY'=>'斯普林菲尔德','ORH'=>'伍斯特',)),
                'MT'=>array('name'=>'蒙大拿','city'=>array('BGS'=>'比灵斯','GTF'=>'大瀑布村','MSO'=>'米苏拉',)),
                'MO'=>array('name'=>'密苏里','city'=>array('COV'=>'哥伦比亚','JEF'=>'杰佛逊市','MKC'=>'堪萨斯城','STL'=>'圣路易斯','SGF'=>'斯普林菲尔德',)),
                'MS'=>array('name'=>'密西西比','city'=>array('BIX'=>'比洛克西','GPT'=>'格尔夫波特','GLH'=>'格林维尔','HBG'=>'哈蒂斯堡','JAN'=>'杰克逊','MEI'=>'默里迪恩','VKS'=>'维克斯堡',)),
                'MI'=>array('name'=>'密歇根','city'=>array('ARB'=>'安娜堡','BTL'=>'巴特尔克里克','BCY'=>'贝城','GRR'=>'大急流城','DEO'=>'迪尔伯恩','DET'=>'底特律','FNT'=>'弗林特','WYD'=>'怀恩多特','AZO'=>'卡拉马袓','LAN'=>'兰辛','MKG'=>'马斯基根','PTK'=>'庞菷亚克','SGM'=>'萨吉诺','SSM'=>'苏圣玛丽','WAM'=>'沃伦','PHN'=>'休伦港',)),
                'ME'=>array('name'=>'缅因','city'=>array('BNQ'=>'班戈','POL'=>'波特兰','QLW'=>'刘易斯顿',)),
                'MN'=>array('name'=>'明尼苏达','city'=>array('RST'=>'罗切斯特','MES'=>'明尼阿波利斯','STP'=>'圣保罗',)),
                'SD'=>array('name'=>'南达科他','city'=>array('ABK'=>'阿伯丁','RAP'=>'拉皮德城','FSD'=>'苏福尔斯',)),
                'SC'=>array('name'=>'南卡罗来纳','city'=>array('NTS'=>'北查尔斯顿','CHS'=>'查尔斯顿','COV'=>'哥伦比亚',)),
                'NE'=>array('name'=>'内布拉斯加','city'=>array('OMA'=>'奥马哈','XDE'=>'贝尔维尤','LNK'=>'林肯',)),
                'NV'=>array('name'=>'内华达','city'=>array('EKO'=>'埃尔科','NVS'=>'北拉斯维加斯','VGI'=>'弗吉尼亚城','HNZ'=>'亨德森','CSN'=>'卡森城','LAS'=>'拉斯维加斯','RNO'=>'里诺','SPK'=>'斯帕克斯',)),
                'NY'=>array('name'=>'纽约','city'=>array('FFO'=>'布法罗','ROC'=>'罗切斯特','QEE'=>'纽约市',)),
                'DE'=>array('name'=>'特拉华','city'=>array('DOR'=>'多佛','NWK'=>'纽瓦克','ILG'=>'威明顿',)),
                'TN'=>array('name'=>'田纳西','city'=>array('BSJ'=>'布利斯托','CHA'=>'查塔努加','TRI'=>'金斯波特','MEM'=>'孟菲斯','BNA'=>'纳什维尔','TYS'=>'诺克斯维尔','YTC'=>'三城区','MQY'=>'士麦那','RGI'=>'斯普林希尔','JCY'=>'约翰逊城',)),
                'WI'=>array('name'=>'威斯康星','city'=>array('ATW'=>'阿普尓顿','OSH'=>'奥什科什','GBK'=>'格林贝','ENW'=>'基诺沙','LSE'=>'拉克罗斯','RAC'=>'拉辛','MTW'=>'马尼托沃克','QMD'=>'迈迪逊','MKE'=>'密尔沃基','EAU'=>'欧克莱尓','AUW'=>'沃索','SBM'=>'希博伊根',)),
                'VA'=>array('name'=>'维吉尼亚','city'=>array('VAB'=>'弗吉尼亚比奇','ORF'=>'诺福克','HTW'=>'切萨皮克',)),
                'WV'=>array('name'=>'西佛吉尼亚','city'=>array('CRW'=>'查尔斯顿','HNU'=>'亨廷顿','PKB'=>'帕克斯堡',)),
                'HI'=>array('name'=>'夏威夷','city'=>array('KHH'=>'凯卢阿','HNL'=>'檀香山','ITO'=>'希洛',)),
                'NH'=>array('name'=>'新罕布什尔','city'=>array('CON'=>'康科德','MHT'=>'曼彻斯特','ASH'=>'纳舒厄',)),
                'NM'=>array('name'=>'新墨西哥','city'=>array('ABQ'=>'阿尔伯克基','LRU'=>'拉斯克鲁塞斯','ROW'=>'罗斯韦尔','SAF'=>'圣菲',)),
                'NJ'=>array('name'=>'新泽西','city'=>array('NRK'=>'纽瓦克','PAT'=>'帕特森','JEC'=>'泽西城',)),
                'AZ'=>array('name'=>'亚利桑那','city'=>array('PHX'=>'凤凰城','GDA'=>'格兰代尔','MQA'=>'梅萨','STZ'=>'史卡兹代尔','TPE'=>'坦普','TUC'=>'图森','YUM'=>'优玛',)),
                'IL'=>array('name'=>'伊利诺斯','city'=>array('ALN'=>'奥尔顿','AUZ'=>'奥罗拉','BLO'=>'布卢明顿','DVI'=>'丹维尓','DEK'=>'迪卡尔布','DEC'=>'迪凯持','ESL'=>'东圣路易斯','CMI'=>'厄巴纳-香槟','GSU'=>'盖尔斯堡','MDH'=>'卡本代尔','RKI'=>'罗克艾兰','RFD'=>'罗克福德','NOM'=>'诺黙尔','PLA'=>'皮奥里亚','CRA'=>'森特勒利亚','SPI'=>'斯普林菲尔德','UGN'=>'沃其根','CHI'=>'芝加哥',)),
                'IN'=>array('name'=>'印第安那','city'=>array('EVV'=>'埃文斯维尔','FWA'=>'韦恩堡','IND'=>'印第安纳波利斯',)),
                'UT'=>array('name'=>'犹他','city'=>array('OGD'=>'奥格登','LTJ'=>'雷登','OEU'=>'欧仁','PAC'=>'帕克城','PVU'=>'普罗沃','SGU'=>'圣乔治','WVC'=>'西瓦利城','SLC'=>'盐湖城',)),
                'GA'=>array('name'=>'佐治亚','city'=>array('AUT'=>'奥古斯塔','CZX'=>'哥伦布','MCN'=>'梅肯','SAV'=>'沙瓦纳','TAT'=>'亚特兰大',)),
));
Core_Comm_City::$cityConfig['ASM'] = array('name'=>'美属萨摩亚','province'=>array(
                ''=>array('name'=>'','city'=>array('AAN'=>'阿纳','ATU'=>'阿图阿','AIT'=>'艾加伊勒泰','FAA'=>'法塞莱莱阿加','GFG'=>'加盖福毛加','GMG'=>'加加埃毛加','PAL'=>'帕劳利','SAT'=>'萨图帕伊泰阿','SAV'=>'萨瓦伊岛','TUA'=>'图阿马萨加','VAF'=>'瓦奥福诺蒂','VAI'=>'韦西加诺','UPO'=>'乌波卢岛',)),
));
Core_Comm_City::$cityConfig['UMI'] = array('name'=>'美属外岛',);
Core_Comm_City::$cityConfig['MNG'] = array('name'=>'蒙古','province'=>array(
                ''=>array('name'=>'','city'=>array('69'=>'巴彦洪格尔','71'=>'巴彦乌勒盖','67'=>'布尔干','37'=>'达尔汗乌勒','61'=>'东方','63'=>'东戈壁','35'=>'鄂尔浑','65'=>'戈壁阿尔泰','64'=>'戈壁苏木贝尔','73'=>'后杭爱','43'=>'科布多','39'=>'肯特','41'=>'库苏古尔','UMN'=>'南戈壁','UVO'=>'前杭爱','49'=>'色楞格','51'=>'苏赫巴托尔','46'=>'乌布苏','1'=>'乌兰巴托市','57'=>'扎布汗','59'=>'中戈壁','47'=>'中央',)),
));
Core_Comm_City::$cityConfig['MSR'] = array('name'=>'蒙特塞拉特',);
Core_Comm_City::$cityConfig['BGD'] = array('name'=>'孟加拉','province'=>array(
                ''=>array('name'=>'','city'=>array('DAC'=>'达卡','CGP'=>'吉大港','KHL'=>'库尔纳',)),
));
Core_Comm_City::$cityConfig['FSM'] = array('name'=>'密克罗尼西亚',);
Core_Comm_City::$cityConfig['PER'] = array('name'=>'秘鲁','province'=>array(
                ''=>array('name'=>'','city'=>array('AR'=>'阿雷基帕','AP'=>'阿普里马克','AY'=>'阿亚库乔','AN'=>'安卡什','JUL'=>'胡利亚卡','JU'=>'胡宁','CJ'=>'卡哈马卡','CL'=>'卡亚俄','CU'=>'库斯科','LD'=>'拉利伯塔德','LY'=>'兰巴耶克','LI'=>'利马','LO'=>'洛雷托','MD'=>'马德雷德迪奥斯','MO'=>'莫克瓜','PA'=>'帕斯科','PI'=>'皮乌拉','PU'=>'普诺','CHM'=>'钦博特','CHI'=>'钦查阿尔塔','SM'=>'圣马丁','SUL'=>'苏拉纳','TA'=>'塔克纳','TU'=>'通贝斯','HO'=>'瓦努科','HV'=>'万卡维利卡','UC'=>'乌卡亚利','AM'=>'亚马孙','IC'=>'伊卡',)),
));
Core_Comm_City::$cityConfig['MMR'] = array('name'=>'缅甸','province'=>array(
                ''=>array('name'=>'','city'=>array('BG'=>'勃固省','SH'=>'掸邦','TN'=>'德林达依省','KN'=>'克伦邦','KC'=>'克钦邦','KH'=>'克耶邦','MG'=>'马圭省','MD'=>'曼德勒省','MN'=>'孟邦','CH'=>'钦邦','RK'=>'若开邦','SG'=>'实皆省','YG'=>'仰光省','AY'=>'伊洛瓦底省',)),
));
Core_Comm_City::$cityConfig['MDA'] = array('name'=>'摩尔多瓦',);
Core_Comm_City::$cityConfig['MAR'] = array('name'=>'摩洛哥','province'=>array(
                ''=>array('name'=>'','city'=>array('TGR'=>'丹吉尔','TET'=>'得土安','FES'=>'非斯','CBL'=>'卡萨布兰卡','RSA'=>'拉巴特','MRK'=>'马拉喀什','MKN'=>'梅克内斯','OUJ'=>'乌季达','WSH'=>'西撒哈拉',)),
));
Core_Comm_City::$cityConfig['MCO'] = array('name'=>'摩纳哥',);
Core_Comm_City::$cityConfig['MOZ'] = array('name'=>'莫桑比克',);
Core_Comm_City::$cityConfig['MEX'] = array('name'=>'墨西哥','province'=>array(
                ''=>array('name'=>'','city'=>array('AGU'=>'阿瓜斯卡连斯特','ACA'=>'阿卡普尔科','HMO'=>'埃莫西约','CAM'=>'埃佩切','OBR'=>'奥夫雷贡城','ORI'=>'奥里萨巴','VHM'=>'巴利城','PVR'=>'巴亚尔塔港','VSA'=>'比利亚埃尔莫萨','PRH'=>'波萨里卡','TIJ'=>'蒂华纳','DUR'=>'杜兰戈','ESE'=>'恩塞纳达','GDL'=>'瓜达拉哈拉','GUA'=>'瓜纳华托','JAL'=>'哈拉帕','JUZ'=>'华雷斯','BJU'=>'华雷斯港','CAR'=>'卡门','COL'=>'科利马','QUE'=>'克雷塔罗','CVC'=>'库埃纳瓦卡','CUL'=>'库利阿坎','COA'=>'夸察夸拉克斯','LAP'=>'拉巴斯','LEN'=>'莱昂','REX'=>'雷诺萨','LMM'=>'洛斯莫奇斯','MZT'=>'马萨特兰','MAM'=>'马塔莫罗斯','MID'=>'梅里达','LOV'=>'蒙克洛瓦','MTY'=>'蒙特雷','MLM'=>'莫雷利亚','MEX'=>'墨西哥城','MXL'=>'墨西卡利','NOG'=>'诺加莱斯','PAC'=>'帕丘卡','PUE'=>'普埃布拉','CHI'=>'奇尔潘辛戈','CHH'=>'奇瓦瓦','CTM'=>'切图马尔','SLW'=>'萨尔蒂约','ZAC'=>'萨卡特卡斯','CLY'=>'塞拉亚','SLP'=>'圣路易斯波托亚','TAP'=>'塔帕丘拉','TAM'=>'坦皮科','TLA'=>'特拉斯卡拉','TPQ'=>'特皮克','TCN'=>'特瓦坎','TGZ'=>'图斯特拉-古铁雷斯','TRC'=>'托雷翁','TLC'=>'托卢卡','OAX'=>'瓦哈卡','VIC'=>'维多利亚城','VER'=>'韦拉克鲁斯','UPN'=>'乌鲁阿潘','NLE'=>'新拉雷多','IRP'=>'伊拉普阿托',)),
));
Core_Comm_City::$cityConfig['NAM'] = array('name'=>'纳米比亚','province'=>array(
                ''=>array('name'=>'','city'=>array('ER'=>'埃龙戈','OW'=>'奥汉圭纳','KV'=>'奥卡万戈','OK'=>'奥马赫科','OT'=>'奥姆沙蒂','OJ'=>'奥乔宗蒂约巴','ON'=>'奥沙纳','OO'=>'奥希科托','HA'=>'哈达普','KH'=>'霍马斯','KR'=>'卡拉斯','CA'=>'卡普里维','KU'=>'库内内',)),
));
Core_Comm_City::$cityConfig['ZAF'] = array('name'=>'南非','province'=>array(
                ''=>array('name'=>'','city'=>array('UTN'=>'阿平顿','MAY'=>'艾利弗山','PZB'=>'彼德马里茨堡','PTG'=>'彼德斯堡','PRY'=>'比勒陀利亚','BIY'=>'比索','BDD'=>'布雷达斯多普','BFN'=>'布隆方丹','BHT'=>'布隆克斯特斯普利特','DAA'=>'德阿尔','DUR'=>'德班','DUN'=>'邓迪','BAE'=>'东巴克利','ELS'=>'东伦敦','VRU'=>'弗雷堡','VGG'=>'弗里尼欣','GBD'=>'格罗布莱斯达尔','GIY'=>'基雅尼','KIM'=>'金伯利','CPT'=>'开普敦','KXE'=>'克莱克斯多普','KMH'=>'库鲁曼','UTW'=>'昆士敦','LAY'=>'莱迪史密斯','RFT'=>'兰德方丹','RCB'=>'理查兹湾','RSB'=>'利斯滕堡','MDB'=>'米德尔堡','MZQ'=>'姆库泽','MOO'=>'穆里斯堡','NLP'=>'内尔斯普雷特','NYL'=>'尼尔斯特隆','NCS'=>'纽卡斯尔','GRJ'=>'乔治','SAS'=>'萨索尔堡','ZEC'=>'瑟孔达','IXO'=>'特克索波','TPB'=>'特隆普斯堡','SBU'=>'跳羚','TLH'=>'图拉马哈谢','THY'=>'托霍延杜','WSH'=>'韦茨肖克','WEL'=>'韦尔科姆','ULD'=>'乌伦迪','UTT'=>'乌姆塔塔','WOR'=>'伍斯特','BEW'=>'西博福特','PSS'=>'谢普斯通港','PLZ'=>'伊丽莎白港','JNB'=>'约翰内斯堡',)),
));
Core_Comm_City::$cityConfig['ATA'] = array('name'=>'南极洲',);
Core_Comm_City::$cityConfig['SGS'] = array('name'=>'南乔治亚和南桑德威奇群岛',);
Core_Comm_City::$cityConfig['NRU'] = array('name'=>'瑙鲁',);
Core_Comm_City::$cityConfig['NPL'] = array('name'=>'尼泊尔','province'=>array(
                ''=>array('name'=>'','city'=>array('BA'=>'巴格马蒂','DH'=>'道拉吉里','GA'=>'甘达基','KO'=>'戈西','KA'=>'格尔纳利','JA'=>'贾纳克布尔','RA'=>'拉布蒂','LU'=>'蓝毗尼','MA'=>'马哈卡利','ME'=>'梅吉','NA'=>'纳拉亚尼','BH'=>'佩里','SA'=>'萨加玛塔','SE'=>'塞蒂',)),
));
Core_Comm_City::$cityConfig['NIC'] = array('name'=>'尼加拉瓜','province'=>array(
                ''=>array('name'=>'','city'=>array('ES'=>'埃斯特利','AN'=>'北大西洋','BO'=>'博阿科','GR'=>'格拉纳达','CA'=>'卡拉索','LE'=>'莱昂','RV'=>'里瓦斯','MD'=>'马德里斯','MN'=>'马那瓜','MS'=>'马萨亚','MT'=>'马塔加尔帕','AS'=>'南大西洋','CD'=>'奇南德加','CT'=>'琼塔莱斯','SJ'=>'圣胡安河','JI'=>'希诺特加','NS'=>'新塞哥维亚',)),
));
Core_Comm_City::$cityConfig['NER'] = array('name'=>'尼日尔','province'=>array(
                ''=>array('name'=>'','city'=>array('AJY'=>'阿加德兹','DIF'=>'迪法','TIL'=>'蒂拉贝里','DSS'=>'多索','ZND'=>'津德尔','MFQ'=>'马拉迪','NIM'=>'尼亚美市','THZ'=>'塔瓦',)),
));
Core_Comm_City::$cityConfig['NGA'] = array('name'=>'尼日利亚','province'=>array(
                ''=>array('name'=>'','city'=>array('ABV'=>'阿比亚','OGB'=>'奥博莫绍','KAN'=>'卡诺','LOS'=>'拉各斯','IBA'=>'伊巴丹',)),
));
Core_Comm_City::$cityConfig['NIU'] = array('name'=>'纽埃',);
Core_Comm_City::$cityConfig['NOR'] = array('name'=>'挪威','province'=>array(
                ''=>array('name'=>'','city'=>array('2'=>'阿克什胡斯','5'=>'奥普兰','3'=>'奥斯陆市','17'=>'北特伦德拉格','6'=>'布斯克吕','9'=>'东阿格德尔','1'=>'东福尔','20'=>'芬马克','4'=>'海德马克','12'=>'霍达兰','11'=>'罗加兰','15'=>'默勒－鲁姆斯达尔','16'=>'南特伦德拉格','18'=>'诺尔兰','14'=>'松恩－菲尤拉讷','8'=>'泰勒马克','19'=>'特罗姆斯','10'=>'西阿格德尔','7'=>'西福尔',)),
));
Core_Comm_City::$cityConfig['NFK'] = array('name'=>'诺福克',);
Core_Comm_City::$cityConfig['PLW'] = array('name'=>'帕劳群岛',);
Core_Comm_City::$cityConfig['PCN'] = array('name'=>'皮特凯恩',);
Core_Comm_City::$cityConfig['PRT'] = array('name'=>'葡萄牙','province'=>array(
                ''=>array('name'=>'','city'=>array('ALL'=>'滨海阿连特茹','PLT'=>'滨海皮尼亚尔','VDP'=>'波尔图','MDR'=>'杜罗','EDV'=>'恩特拉杜罗伏日 　 　','FAO'=>'法鲁','FUN'=>'丰沙尔','CAV'=>'卡瓦多  　 　','CLB'=>'科瓦贝拉  　 　 　','LIS'=>'里斯本','LTE'=>'利巴特茹','MTE'=>'梅地奥特茹 　','MLI'=>'米尼奥-利马 　','BIN'=>'内贝拉北','BIS'=>'内贝拉南 　','PIN'=>'内皮尼亚尔北','PIS'=>'内皮尼亚尔南  　','PDL'=>'蓬塔德尔加达','PSE'=>'塞图巴尔半岛','SES'=>'山后','AAT'=>'上阿连特茹','ATM'=>'上特拉斯山  　 　','TAM'=>'塔梅加','AES'=>'万福','OES'=>'西部','BAL'=>'下阿连特茹','BVO'=>'下伏日','BMO'=>'下蒙德古','ALC'=>'中阿连特茹',)),
));
Core_Comm_City::$cityConfig['GEO'] = array('name'=>'乔治亚',);
Core_Comm_City::$cityConfig['JPN'] = array('name'=>'日本','province'=>array(
                ''=>array('name'=>'','city'=>array('38'=>'爱媛','23'=>'爱知','1'=>'北海道','28'=>'兵库','47'=>'冲绳','8'=>'茨城','27'=>'大阪','44'=>'大分','32'=>'岛根','36'=>'徳岛','13'=>'东京','7'=>'福岛','40'=>'福冈','18'=>'福井','16'=>'富山','33'=>'冈山','39'=>'高知','4'=>'宮城','45'=>'宫崎','34'=>'广岛','30'=>'和歌山','26'=>'京都','22'=>'静冈','9'=>'枥木','46'=>'鹿儿岛','29'=>'奈良','31'=>'鸟取','21'=>'岐阜','11'=>'埼玉','12'=>'千叶','2'=>'青森','5'=>'秋田','10'=>'群马','24'=>'三重','35'=>'山口','19'=>'山梨','6'=>'山形','14'=>'神奈川','17'=>'石川','37'=>'香川','15'=>'新潟','43'=>'熊本','3'=>'岩手','42'=>'长崎','20'=>'长野','25'=>'滋贺','41'=>'佐贺',)),
));
Core_Comm_City::$cityConfig['SWE'] = array('name'=>'瑞典','province'=>array(
                ''=>array('name'=>'','city'=>array('BD'=>'北博滕','K'=>'布莱金厄','DLN'=>'达拉纳','UGL'=>'东约特兰','T'=>'厄勒布鲁','I'=>'哥得兰','N'=>'哈兰','H'=>'卡尔马','G'=>'克鲁努贝里','D'=>'南曼兰','AB'=>'斯德哥尔摩','M'=>'斯科耐','S'=>'韦姆兰','C'=>'乌普萨拉','AC'=>'西博滕','U'=>'西曼兰','Y'=>'西诺尔兰','O'=>'西约特兰','F'=>'延雪平','X'=>'耶夫勒堡','Z'=>'耶姆特兰',)),
));
Core_Comm_City::$cityConfig['CHE'] = array('name'=>'瑞士','province'=>array(
                ''=>array('name'=>'','city'=>array('AG'=>'阿尔高','BS'=>'巴塞尔城市','BL'=>'巴塞尔乡村','BE'=>'伯尔尼','ZG'=>'楚格','FR'=>'弗里堡','GL'=>'格拉鲁斯','GR'=>'格劳宾登','LU'=>'卢塞恩','LA'=>'洛桑','NE'=>'纳沙泰尔','AI'=>'内阿彭策尔','GE'=>'日内瓦','JU'=>'汝拉','SH'=>'沙夫豪森','OW'=>'上瓦尔登','SG'=>'圣加仑','SZ'=>'施维茨','ZH'=>'苏黎世','SO'=>'索洛图恩','TI'=>'提契诺','TG'=>'图尔高','VS'=>'瓦莱','AR'=>'外阿彭策尔','VD'=>'沃','UR'=>'乌里','NW'=>'下瓦尔登',)),
));
Core_Comm_City::$cityConfig['SLV'] = array('name'=>'萨尔瓦多','province'=>array(
                ''=>array('name'=>'','city'=>array('APO'=>'阿波帕','AH'=>'阿瓦查潘','LI'=>'滨海','CH'=>'查拉特南戈','DE'=>'德尔加多','KN'=>'基埃-恩特姆','CA'=>'卡瓦尼亚斯','CU'=>'库斯卡特兰','PZ'=>'拉巴斯','LB'=>'拉利伯塔德','UN'=>'拉乌尼翁','MEJ'=>'梅基卡诺斯','MO'=>'莫拉桑','SA'=>'圣安娜','SM'=>'圣米格尔','SS'=>'圣萨尔瓦多','SV'=>'圣维森特','SO'=>'松索纳特','SOY'=>'索亚潘戈','WN'=>'韦莱-恩萨斯','US'=>'乌苏卢坦','IL'=>'伊洛潘戈','CS'=>'中南',)),
));
Core_Comm_City::$cityConfig['WSM'] = array('name'=>'萨摩亚',);
Core_Comm_City::$cityConfig['SCG'] = array('name'=>'塞尔维亚,黑山','province'=>array(
                ''=>array('name'=>'','city'=>array('BEG'=>'贝尔格莱德','POD'=>'波德戈里察','KGV'=>'克拉古涅瓦茨','INI'=>'尼什','NVS'=>'诺维萨德','PRN'=>'普里什蒂纳','SUB'=>'苏博蒂察','ZEM'=>'泽蒙',)),
));
Core_Comm_City::$cityConfig['SLE'] = array('name'=>'塞拉利昂','province'=>array(
                ''=>array('name'=>'','city'=>array('N'=>'北部','E'=>'东部','S'=>'南部','W'=>'西部区',)),
));
Core_Comm_City::$cityConfig['SEN'] = array('name'=>'塞内加尔','province'=>array(
                ''=>array('name'=>'','city'=>array('DA'=>'达喀尔','FA'=>'法蒂克','ZI'=>'济金绍尔','TH'=>'捷斯','DI'=>'久尔贝勒','KA'=>'考拉克','KO'=>'科尔达','LO'=>'卢加','MA'=>'马塔姆','SL'=>'圣路易','TA'=>'坦巴昆达',)),
));
Core_Comm_City::$cityConfig['CYP'] = array('name'=>'塞浦路斯','province'=>array(
                ''=>array('name'=>'','city'=>array('4'=>'法马古斯塔','6'=>'凯里尼亚','3'=>'拉纳卡','2'=>'利马索尔','1'=>'尼科西亚','5'=>'帕福斯',)),
));
Core_Comm_City::$cityConfig['SYC'] = array('name'=>'塞舌尔',);
Core_Comm_City::$cityConfig['SAU'] = array('name'=>'沙特阿拉伯','province'=>array(
                ''=>array('name'=>'','city'=>array('ARA'=>'阿尔阿尔','AHB'=>'艾卜哈','BH'=>'巴哈','BUR'=>'布赖代','DAM'=>'达曼','HBT'=>'哈费尔巴廷','HL'=>'哈伊勒','KMX'=>'海米斯穆谢特','AKH'=>'海耶','HFF'=>'胡富夫','JED'=>'吉达','JZ'=>'吉赞','RD'=>'利雅得','MED'=>'麦地那','ML'=>'麦加','MBR'=>'姆巴拉兹','NR'=>'纳季兰','SAK'=>'塞卡卡','TB'=>'塔布克','TAR'=>'塔伊夫','YNB'=>'延布','JBI'=>'朱拜勒',)),
));
Core_Comm_City::$cityConfig['CXR'] = array('name'=>'圣诞岛',);
Core_Comm_City::$cityConfig['STP'] = array('name'=>'圣多美和普林西比',);
Core_Comm_City::$cityConfig['SHN'] = array('name'=>'圣赫勒拿',);
Core_Comm_City::$cityConfig['KNA'] = array('name'=>'圣基茨和尼维斯',);
Core_Comm_City::$cityConfig['LCA'] = array('name'=>'圣卢西亚',);
Core_Comm_City::$cityConfig['SMR'] = array('name'=>'圣马力诺',);
Core_Comm_City::$cityConfig['SPM'] = array('name'=>'圣皮埃尔和米克隆群岛',);
Core_Comm_City::$cityConfig['VCT'] = array('name'=>'圣文森特和格林纳丁斯',);
Core_Comm_City::$cityConfig['LKA'] = array('name'=>'斯里兰卡','province'=>array(
                ''=>array('name'=>'','city'=>array('ADP'=>'阿努拉德普勒','AMP'=>'安帕赖','BAD'=>'巴杜勒','BTC'=>'拜蒂克洛','POL'=>'波隆纳鲁沃','HBA'=>'汉班托特','KIL'=>'基里诺奇','GAL'=>'加勒','GAM'=>'加姆珀哈','JAF'=>'贾夫纳','KLT'=>'卡卢特勒','KEG'=>'凯格勒','KAN'=>'康提','CMB'=>'科伦坡','KUR'=>'库鲁内格勒','RAT'=>'拉特纳普勒','MAN'=>'马纳尔','MAT'=>'马特莱','MAA'=>'马特勒','MON'=>'莫讷勒格勒','MUL'=>'穆莱蒂武','NUE'=>'努沃勒埃利耶','PUT'=>'普塔勒姆','TRR'=>'亭可马里','VAV'=>'瓦武尼亚',)),
));
Core_Comm_City::$cityConfig['SVK'] = array('name'=>'斯洛伐克','province'=>array(
                ''=>array('name'=>'','city'=>array('BBY'=>'班斯卡-比斯特里察','BTS'=>'布拉迪斯拉发','KOR'=>'科希策','NRA'=>'尼特拉','POV'=>'普雷绍夫','RIL'=>'日利纳','TNA'=>'特尔纳瓦','TRE'=>'特伦钦',)),
));
Core_Comm_City::$cityConfig['SVN'] = array('name'=>'斯洛文尼亚','province'=>array(
                ''=>array('name'=>'','city'=>array('OKR'=>'奥巴尔诺-克拉','OSR'=>'奥斯雷德涅斯洛文','POD'=>'波德拉夫','POM'=>'波穆尔','DLJ'=>'多雷尼','GSZ'=>'戈雷尼','GSK'=>'戈里','KOR'=>'科洛','NKR'=>'诺特拉尼','SAV'=>'萨维尼','SPO'=>'斯波德涅波萨夫','ZAS'=>'扎萨夫',)),
));
Core_Comm_City::$cityConfig['SJM'] = array('name'=>'斯瓦尔巴和扬马廷',);
Core_Comm_City::$cityConfig['SWZ'] = array('name'=>'斯威士兰',);
Core_Comm_City::$cityConfig['SDN'] = array('name'=>'苏丹','province'=>array(
                ''=>array('name'=>'','city'=>array('ASH'=>'北部','SIS'=>'赤道','SDA'=>'达尔富尔','SHA'=>'东部','SBG'=>'加扎勒河','KRT'=>'喀土穆','GKU'=>'科尔多凡','ANB'=>'上尼罗','WDH'=>'中部',)),
));
Core_Comm_City::$cityConfig['SUR'] = array('name'=>'苏里南','province'=>array(
                ''=>array('name'=>'','city'=>array('BR'=>'布罗科蓬多','CR'=>'科罗尼','CM'=>'科默韦讷','MA'=>'马罗韦讷','NI'=>'尼克里','PA'=>'帕拉','PM'=>'帕拉马里博','SA'=>'萨拉马卡','WA'=>'瓦尼卡','SI'=>'西帕里韦尼',)),
));
Core_Comm_City::$cityConfig['SLB'] = array('name'=>'所罗门群岛','province'=>array(
                ''=>array('name'=>'','city'=>array('GC'=>'瓜达尔卡纳尔','HO'=>'霍尼亚拉','RB'=>'拉纳尔和贝罗纳','MK'=>'马基拉','ML'=>'马莱塔','CH'=>'乔伊索','TM'=>'泰莫图','WE'=>'西部','IS'=>'伊萨贝尔','CE'=>'中部群岛',)),
));
Core_Comm_City::$cityConfig['SOM'] = array('name'=>'索马里',);
Core_Comm_City::$cityConfig['TJK'] = array('name'=>'塔吉克斯坦','province'=>array(
                ''=>array('name'=>'','city'=>array('DYU'=>'杜尚别','KHO'=>'霍罗格','KAN'=>'卡尼巴达姆','KOF'=>'科法尔尼洪','KHU'=>'苦盏','KTJ'=>'库尔干-秋别','KLB'=>'库洛布','RGU'=>'洛贡','NUR'=>'努雷克','PJK'=>'彭吉肯特','SBA'=>'萨班特','TBS'=>'塔博沙尔','TSZ'=>'图尔孙扎德','UTJ'=>'乌拉秋别','ISF'=>'伊斯法拉',)),
));
Core_Comm_City::$cityConfig['THA'] = array('name'=>'泰国','province'=>array(
                ''=>array('name'=>'','city'=>array('37'=>'安纳乍能','77'=>'巴蜀','13'=>'巴吞他尼','25'=>'巴真','71'=>'北碧','19'=>'北标','94'=>'北大年','11'=>'北揽','60'=>'北榄坡','24'=>'北柳','76'=>'碧差汶','93'=>'博达伦','18'=>'猜那','36'=>'猜也奔','53'=>'程逸','86'=>'春蓬','20'=>'春武里','63'=>'达','23'=>'达叻','14'=>'大城','92'=>'董里','78'=>'佛丕','73'=>'佛统','62'=>'甘烹碧','15'=>'红统','16'=>'华富里','46'=>'加拉信','81'=>'甲米','22'=>'尖竹汶','40'=>'孔敬','21'=>'拉农','43'=>'廊开','39'=>'廊莫那浦','70'=>'叻丕','42'=>'黎','45'=>'黎逸','74'=>'龙仔厝','85'=>'罗勇','80'=>'洛坤','44'=>'玛哈沙拉堪','10'=>'曼谷','49'=>'莫达汉','26'=>'那空那育','48'=>'那空帕农','55'=>'难','51'=>'南奔','12'=>'暖武里','54'=>'帕','56'=>'帕尧','82'=>'攀牙','65'=>'彭世洛','66'=>'披集','83'=>'普吉','57'=>'清莱','50'=>'清迈','47'=>'色军','91'=>'沙敦','27'=>'沙缴','33'=>'四色菊','90'=>'宋卡','64'=>'素可泰','84'=>'素叻','32'=>'素林','72'=>'素攀武里','96'=>'陶公','41'=>'乌隆','61'=>'乌泰他尼','34'=>'乌汶','31'=>'武里南','17'=>'信武里','35'=>'耶梭通','95'=>'也拉','58'=>'夜丰颂','75'=>'夜功',)),
));
Core_Comm_City::$cityConfig['TZA'] = array('name'=>'坦桑尼亚','province'=>array(
                ''=>array('name'=>'','city'=>array('AR'=>'阿鲁沙','PN'=>'奔巴北','PS'=>'奔巴南','PW'=>'滨海','DS'=>'达累斯萨拉姆','DO'=>'多多马','KI'=>'基戈马','KA'=>'卡盖拉','LN'=>'林迪','RK'=>'鲁夸','RV'=>'鲁伍马','MR'=>'马腊','MY'=>'曼亚拉','MO'=>'莫洛戈罗','MB'=>'姆贝亚','MT'=>'姆特瓦拉','MW'=>'姆万扎','KJ'=>'乞力马扎罗','ZN'=>'桑给巴尔','UN'=>'桑给巴尔北','US'=>'桑给巴尔南','MM'=>'桑给巴尔市和西','TB'=>'塔波拉','TN'=>'坦噶','SI'=>'辛吉达','SH'=>'欣延加','IR'=>'伊林加',)),
));
Core_Comm_City::$cityConfig['TON'] = array('name'=>'汤加','province'=>array(
                ''=>array('name'=>'','city'=>array('E'=>'埃瓦','H'=>'哈派','N'=>'纽阿斯','T'=>'汤加塔布','V'=>'瓦瓦乌 ',)),
));
Core_Comm_City::$cityConfig['TCA'] = array('name'=>'特克斯和凯克特斯群岛',);
Core_Comm_City::$cityConfig['TAA'] = array('name'=>'特里斯坦达昆哈',);
Core_Comm_City::$cityConfig['TTO'] = array('name'=>'特立尼达和多巴哥',);
Core_Comm_City::$cityConfig['TUN'] = array('name'=>'突尼斯','province'=>array(
                ''=>array('name'=>'','city'=>array('AR'=>'艾尔亚奈','BJ'=>'巴杰','BA'=>'本阿鲁斯','BI'=>'比塞大','KB'=>'吉比利','GB'=>'加贝斯','GF'=>'加夫萨','JE'=>'坚杜拜','LK'=>'卡夫','KS'=>'卡塞林','KR'=>'凯鲁万','MH'=>'马赫迪耶','MN'=>'马努巴','ME'=>'梅德宁','MO'=>'莫纳斯提尔','NA'=>'纳布勒','SF'=>'斯法克斯','SO'=>'苏塞','TA'=>'泰塔温　 ','TU'=>'突尼斯','TO'=>'托泽尔','SD'=>'西迪布济德','SL'=>'锡勒亚奈','ZA'=>'宰格万',)),
));
Core_Comm_City::$cityConfig['TUV'] = array('name'=>'图瓦卢',);
Core_Comm_City::$cityConfig['TUR'] = array('name'=>'土耳其','province'=>array(
                ''=>array('name'=>'','city'=>array('ADA'=>'阿达纳','ADI'=>'阿德亚曼','ARD'=>'阿尔达罕','ART'=>'阿尔特温','AFY'=>'阿菲永','AKS'=>'阿克萨赖','AGR'=>'阿勒','AMA'=>'阿马西亚','EDI'=>'埃迪尔内','EZC'=>'埃尔津詹','EZR'=>'埃尔祖鲁姆','ELA'=>'埃拉泽','ESK'=>'埃斯基谢希尔','AYI'=>'艾登','ANK'=>'安卡拉','ANT'=>'安塔利亚','ORD'=>'奥尔杜','BAR'=>'巴尔腾','BAL'=>'巴勒克埃西尔','BAT'=>'巴特曼','BAY'=>'巴伊布尔特','BIL'=>'比莱吉克','BIT'=>'比特利斯','BIN'=>'宾格尔','BOL'=>'博卢','BRD'=>'布尔杜尔','BRS'=>'布尔萨','CKR'=>'昌克勒','DEN'=>'代尼兹利','DIY'=>'迪亚巴克尔','VAN'=>'凡','HKR'=>'哈卡里','HTY'=>'哈塔伊','KLS'=>'基利斯','GIR'=>'吉雷松','GAZ'=>'加济安泰普','GMS'=>'居米什哈内','KRS'=>'卡尔斯','KAH'=>'卡赫拉曼马拉什','KRB'=>'卡拉比克','KRM'=>'卡拉曼','KAS'=>'卡斯塔莫努','KAY'=>'开塞利','KOC'=>'科贾埃利','KLR'=>'柯克拉雷利','KON'=>'科尼亚','KRH'=>'克尔谢希尔','KRK'=>'克勒克卡莱','URF'=>'拉飞','RIZ'=>'里泽','MAR'=>'马尔丁','MAL'=>'马拉蒂亚','MAN'=>'马尼萨','MUG'=>'穆拉','MUS'=>'穆什','NEV'=>'内夫谢希尔','NIG'=>'尼代','CKL'=>'恰纳卡莱','COR'=>'乔鲁姆','KUT'=>'屈塔希亚','SAK'=>'萨卡里亚','SAM'=>'萨姆松','TEL'=>'泰基尔达','TRA'=>'特拉布宗','TUN'=>'通杰利','TOK'=>'托卡特','USK'=>'乌萨克','SIR'=>'锡尔纳克','SII'=>'锡尔特','SIN'=>'锡诺普','SIV'=>'锡瓦斯','IGD'=>'伊迪尔','ICE'=>'伊切尔','ISP'=>'伊斯帕尔塔','IST'=>'伊斯坦布尔','IZM'=>'伊兹密尔','YOZ'=>'约兹加特','ZON'=>'宗古尔达克',)),
));
Core_Comm_City::$cityConfig['TKM'] = array('name'=>'土库曼斯坦','province'=>array(
                ''=>array('name'=>'','city'=>array('A'=>'阿哈尔','ASB'=>'阿什哈巴德市','B'=>'巴尔坎','D'=>'达沙古兹','L'=>'列巴普','M'=>'马雷','NEB'=>'涅比特达格',)),
));
Core_Comm_City::$cityConfig['TKL'] = array('name'=>'托克劳',);
Core_Comm_City::$cityConfig['WLF'] = array('name'=>'瓦利斯和福图纳',);
Core_Comm_City::$cityConfig['VUT'] = array('name'=>'瓦努阿图','province'=>array(
                ''=>array('name'=>'','city'=>array('MA'=>'马朗帕','PE'=>'彭纳马','SA'=>'桑马','TA'=>'塔菲阿','TO'=>'托尔巴','SH'=>'谢法',)),
));
Core_Comm_City::$cityConfig['GTM'] = array('name'=>'危地马拉','province'=>array(
                ''=>array('name'=>'','city'=>array('PR'=>'埃尔普罗格雷索','ES'=>'埃斯昆特拉','JA'=>'哈拉帕','JU'=>'胡蒂亚帕','QC'=>'基切','QZ'=>'克萨尔特南戈','RE'=>'雷塔卢莱乌','MIX'=>'米克斯科','PE'=>'佩滕','CQ'=>'奇基穆拉','CM'=>'奇马尔特南戈','ZA'=>'萨卡帕','ST'=>'萨卡特佩克斯','AV'=>'上韦拉帕斯','SR'=>'圣罗莎','SM'=>'圣马科斯','SU'=>'苏奇特佩克斯','SO'=>'索洛拉','TO'=>'托托尼卡潘','GU'=>'危地马拉','HU'=>'韦韦特南戈','BV'=>'下韦拉帕斯','VIN'=>'新城','IZ'=>'伊萨瓦尔',)),
));
Core_Comm_City::$cityConfig['VIR'] = array('name'=>'维尔京群岛，美属',);
Core_Comm_City::$cityConfig['VGB'] = array('name'=>'维尔京群岛，英属',);
Core_Comm_City::$cityConfig['VEN'] = array('name'=>'委内瑞拉','province'=>array(
                ''=>array('name'=>'','city'=>array('D'=>'阿拉瓜','Y'=>'阿马库罗三角洲','C'=>'阿普雷','B'=>'安索阿特吉','E'=>'巴里纳斯','F'=>'玻利瓦尔','P'=>'波图格萨','I'=>'法尔孔','J'=>'瓜里科','A'=>'加拉加斯','G'=>'卡拉沃沃','H'=>'科赫德斯','K'=>'拉腊','W'=>'联邦属地','L'=>'梅里达','M'=>'米兰达','N'=>'莫纳加斯','R'=>'苏克雷','V'=>'苏利亚','S'=>'塔奇拉','T'=>'特鲁希略','O'=>'新埃斯帕塔','U'=>'亚拉奎','Z'=>'亚马孙',)),
));
Core_Comm_City::$cityConfig['BRN'] = array('name'=>'文莱',);
Core_Comm_City::$cityConfig['UGA'] = array('name'=>'乌干达','province'=>array(
                ''=>array('name'=>'','city'=>array('ARU'=>'阿鲁阿 ','APC'=>'阿帕克 ','ADJ'=>'阿朱马尼 ','BUN'=>'本迪布焦 ','BUG'=>'布吉里 ','BUS'=>'布西亚 ','BSH'=>'布谢尼 ','NTU'=>'恩通加莫 ','GUL'=>'古卢 ','HOI'=>'霍伊马 ','KBA'=>'基巴莱 ','KIB'=>'基博加 ','KYE'=>'基恩乔乔 ','KIS'=>'基索罗 ','KIT'=>'基特古姆 ','JIN'=>'金贾 ','KBL'=>'卡巴莱 ','KAR'=>'卡巴罗莱 ','KAB'=>'卡贝拉马伊多 ','KAL'=>'卡兰加拉 ','KAM'=>'卡姆文盖 ','KML'=>'卡穆利 ','KAN'=>'卡农古 ','KPC'=>'卡普乔鲁瓦 ','KAS'=>'卡塞塞 ','KTK'=>'卡塔奎 ','KAY'=>'卡永加 ','KMP'=>'坎帕拉 ','KOT'=>'科蒂多 ','KUM'=>'库米 ','RAK'=>'拉卡伊 ','LIR'=>'利拉 ','LUW'=>'卢韦罗 ','RUK'=>'鲁昆吉里 ','MAS'=>'马萨卡 ','MSN'=>'马辛迪 ','MAY'=>'马尤盖 ','MRT'=>'莫罗托 ','MOY'=>'莫约 ','MBR'=>'姆巴拉拉 ','MBA'=>'姆巴莱 ','MPI'=>'姆皮吉 ','MUB'=>'穆本德 ','MUK'=>'穆科诺 ','NAK'=>'纳卡皮里皮里特 ','NKS'=>'纳卡松戈拉 ','NEB'=>'内比 　 ','PAD'=>'帕德尔 ','PAL'=>'帕利萨 ','SEM'=>'森巴布莱 ','SOR'=>'索罗提 ','TOR'=>'托罗罗 ','WAK'=>'瓦基索 ','SIR'=>'锡龙科 ','IGA'=>'伊甘加 ','YUM'=>'永贝 ',)),
));
Core_Comm_City::$cityConfig['UKR'] = array('name'=>'乌克兰','province'=>array(
                ''=>array('name'=>'','city'=>array('51'=>'敖德萨','53'=>'波尔塔瓦','12'=>'第聂伯罗波得罗夫斯克','14'=>'顿涅茨克','63'=>'哈尔科夫','65'=>'赫尔松州','68'=>'赫梅利尼茨基','30'=>'基辅','35'=>'基洛夫格勒','61'=>'捷尔诺波尔','43'=>'克里米亚自治共和国','46'=>'利沃夫','9'=>'卢甘斯克','56'=>'罗夫诺','48'=>'尼古拉耶夫','71'=>'切尔卡瑟','74'=>'切尔尼戈夫','77'=>'切尔诺夫策','18'=>'日托米尔','59'=>'苏梅','21'=>'外喀尔巴阡','5'=>'文尼察','7'=>'沃伦','26'=>'伊万－弗兰科夫州','23'=>'扎波罗热',)),
));
Core_Comm_City::$cityConfig['URY'] = array('name'=>'乌拉圭','province'=>array(
                ''=>array('name'=>'','city'=>array('AR'=>'阿蒂加斯','DU'=>'杜拉斯诺','FA'=>'佛罗里达','FS'=>'弗洛雷斯','CA'=>'卡内洛内斯','CO'=>'科洛尼亚','LA'=>'拉瓦耶哈','RV'=>'里韦拉','RO'=>'罗恰','MA'=>'马尔多纳多','MO'=>'蒙得维的亚','RN'=>'内格罗河','PA'=>'派桑杜','SL'=>'萨尔托','CL'=>'塞罗拉尔戈','TT'=>'三十三人','SJ'=>'圣何塞','SO'=>'索里亚诺','TAW'=>'塔夸伦博',)),
));
Core_Comm_City::$cityConfig['UZB'] = array('name'=>'乌兹别克斯坦','province'=>array(
                ''=>array('name'=>'','city'=>array('AN'=>'安集延','BU'=>'布哈拉','FA'=>'费尔干纳','XO'=>'花拉子模','JI'=>'吉扎克','QR'=>'卡拉卡尔帕克斯坦共和国','QA'=>'卡什卡达里亚','NG'=>'纳曼干','NW'=>'纳沃伊','SA'=>'撒马尔罕','SU'=>'苏尔汉河','TK'=>'塔什干','TO'=>'塔什干市','SI'=>'锡尔河',)),
));
Core_Comm_City::$cityConfig['ESP'] = array('name'=>'西班牙','province'=>array(
                ''=>array('name'=>'','city'=>array('LEI'=>'阿尔梅里亚','ALB'=>'阿尔瓦塞特','ALA'=>'阿拉瓦','ALC'=>'阿利坎特','AST'=>'阿斯图利亚斯','AVI'=>'阿维拉','ORE'=>'奥伦塞','BJZ'=>'巴达霍斯','BLR'=>'巴利阿里','VLL'=>'巴利亚多利德','VLC'=>'巴伦西亚','BCN'=>'巴塞罗那','VSE'=>'比斯开','BUR'=>'布尔戈斯','GRX'=>'格拉纳达','GUA'=>'瓜达拉哈拉','JAE'=>'哈恩','GRO'=>'赫罗纳','GUI'=>'吉普斯夸','CAD'=>'加的斯','CCS'=>'卡塞雷斯','CIR'=>'卡斯蒂利亚','CAS'=>'卡斯特利翁','ODB'=>'科尔多瓦','CUE'=>'昆卡','LCG'=>'拉科鲁尼亚','ARL'=>'拉里奥哈','LPA'=>'拉斯帕尔马斯','LEN'=>'莱昂','LLE'=>'莱里达','LGO'=>'卢戈','MAD'=>'马德里','AGP'=>'马拉加','MJV'=>'穆尔西亚','NVV'=>'纳瓦拉','PAC'=>'帕伦西亚','PEV'=>'蓬特韦德拉','ZAZ'=>'萨拉戈萨 ','SLM'=>'萨拉曼卡','ZMR'=>'萨莫拉','SEG'=>'塞哥维亚','SVQ'=>'塞维利亚','SDR'=>'桑坦德','SCT'=>'圣克鲁斯-德特内里费','SOR'=>'索里亚','TAR'=>'塔拉戈纳','TER'=>'特鲁埃尔','TOL'=>'托莱多','HUV'=>'韦尔瓦','HUC'=>'韦斯卡',)),
));
Core_Comm_City::$cityConfig['GRC'] = array('name'=>'希腊','province'=>array(
                ''=>array('name'=>'','city'=>array('PRI'=>'比雷埃夫斯','DO'=>'多德卡尼斯','CHQ'=>'干尼亚','CY'=>'基克拉迪','LST'=>'拉西锡','LES'=>'莱斯博斯','RET'=>'雷西姆农','SMI'=>'萨摩斯','ATH'=>'雅典','HER'=>'伊拉克里翁',)),
));
Core_Comm_City::$cityConfig['SGP'] = array('name'=>'新加坡',);
Core_Comm_City::$cityConfig['NCL'] = array('name'=>'新喀里多尼亚',);
Core_Comm_City::$cityConfig['NZL'] = array('name'=>'新西兰','province'=>array(
                ''=>array('name'=>'','city'=>array('AUK'=>'奥克兰','NSH'=>'北岸','PMR'=>'北帕默斯顿','FNR'=>'北远','BHE'=>'布莱尼姆','DUD'=>'达尼丁','GMN'=>'格雷茅斯','HLZ'=>'哈密尔顿','HAS'=>'黑斯廷斯','WAE'=>'怀塔科拉','GIS'=>'吉斯伯恩','KAI'=>'凯帕拉','CHC'=>'克赖斯特彻奇','RMD'=>'里士满','MNK'=>'马努考','NSN'=>'纳尔逊','NPE'=>'内皮尔','STR'=>'斯特拉特福德','TAU'=>'陶马鲁努伊','WHK'=>'瓦卡塔尼','WRE'=>'旺阿雷','WAG'=>'旺格努伊','NPL'=>'新普利茅斯','IVC'=>'因弗卡吉尔',)),
));
Core_Comm_City::$cityConfig['HUN'] = array('name'=>'匈牙利','province'=>array(
                ''=>array('name'=>'','city'=>array('BA'=>'巴兰尼亚','BK'=>'巴奇-基什孔','BZ'=>'包尔绍德-奥包乌伊-曾普伦','BE'=>'贝凯什','BU'=>'布达佩斯','FE'=>'费耶尔','HB'=>'豪伊杜-比豪尔','HE'=>'赫维什','JN'=>'加兹-纳杰孔-索尔诺克','GS'=>'杰尔-莫松-肖普朗','KE'=>'科马罗姆','NO'=>'诺格拉德','PE'=>'佩斯','CS'=>'琼格拉德','SO'=>'绍莫吉','SZ'=>'索博尔奇-索特马尔-贝拉格','TO'=>'托尔瑙','VE'=>'维斯普雷姆','VA'=>'沃什','ZA'=>'佐洛',)),
));
Core_Comm_City::$cityConfig['SYR'] = array('name'=>'叙利亚','province'=>array(
                ''=>array('name'=>'','city'=>array('HL'=>'阿勒颇','RD'=>'大马士革','DI'=>'大马士革市','DZ'=>'代尔祖尔','DA'=>'德拉','HM'=>'哈马','HA'=>'哈塞克','HI'=>'霍姆斯','GH'=>'加布','QA'=>'卡米什利','QU'=>'库奈特拉','RQ'=>'拉卡','LA'=>'拉塔基亚','SU'=>'苏韦达','TA'=>'塔尔图斯','ID'=>'伊德利卜',)),
));
Core_Comm_City::$cityConfig['JAM'] = array('name'=>'牙买加','province'=>array(
                ''=>array('name'=>'','city'=>array('POR'=>'波特兰','HAN'=>'汉诺威','KIN'=>'金斯敦','CLA'=>'克拉伦登','MAN'=>'曼彻斯特','AND'=>'圣安德鲁斯','ANN'=>'圣安娜','CAT'=>'圣凯瑟琳','MAR'=>'圣玛丽','THO'=>'圣托马斯','ELI'=>'圣伊丽莎白','JAM'=>'圣詹姆斯','TRL'=>'特里洛尼','WML'=>'西摩兰',)),
));
Core_Comm_City::$cityConfig['ARM'] = array('name'=>'亚美尼亚','province'=>array(
                ''=>array('name'=>'','city'=>array('ARM'=>'阿尔马维尔','AGT'=>'阿拉加措特恩','ARA'=>'阿拉拉特','EVN'=>'埃里温市','GEG'=>'格加尔库尼克','KOT'=>'科泰克','LOR'=>'洛里','TAV'=>'塔武什','VAY'=>'瓦约茨·佐尔','SHI'=>'希拉克','SYU'=>'休尼克',)),
));
Core_Comm_City::$cityConfig['YEM'] = array('name'=>'也门','province'=>array(
                ''=>array('name'=>'','city'=>array('AB'=>'阿比扬','AM'=>'阿姆兰','BA'=>'贝达','DA'=>'达利','HD'=>'哈德拉毛','HJ'=>'哈杰','HU'=>'荷台达','JA'=>'焦夫','LA'=>'拉赫季','MA'=>'马里卜','MR'=>'迈赫拉','MW'=>'迈赫维特','SD'=>'萨达','SN'=>'萨那','GXF'=>'赛文','SH'=>'舍卜沃','TA'=>'塔伊兹','ASR'=>'希赫尔','AD'=>'亚丁','IB'=>'伊卜','DH'=>'扎玛尔',)),
));
Core_Comm_City::$cityConfig['IRQ'] = array('name'=>'伊拉克',);
Core_Comm_City::$cityConfig['IRN'] = array('name'=>'伊朗',);
Core_Comm_City::$cityConfig['ISR'] = array('name'=>'以色列','province'=>array(
                ''=>array('name'=>'','city'=>array('ASH'=>'阿什杜德','BEV'=>'贝尔谢巴','BAT'=>'贝特雁','HFA'=>'海法','HOL'=>'霍隆','NAT'=>'内坦亚','TLV'=>'特拉维夫','J'=>'耶路撒冷',)),
));
Core_Comm_City::$cityConfig['ITA'] = array('name'=>'意大利','province'=>array(
                ''=>array('name'=>'','city'=>array('AST'=>'阿斯蒂','ASP'=>'阿斯科利皮切诺','AOI'=>'安科纳','OLB'=>'奥尔比亚','QOS'=>'奥里斯塔诺','AOT'=>'奥斯塔','PMO'=>'巴勒莫','BRI'=>'巴里','BGO'=>'贝加莫','BEN'=>'贝内文托','PSA'=>'比萨','PRD'=>'波代诺内','QPO'=>'波坦察','BLQ'=>'博洛尼亚','BIE'=>'布拉','BRC'=>'布雷西亚','BDS'=>'布林迪西','TRS'=>'的里雅斯特','TRN'=>'都灵','FRR'=>'费拉拉','FLR'=>'佛罗伦萨','FOG'=>'福贾','CAG'=>'卡利亚里','CST'=>'卡塞塔','CTA'=>'卡塔尼亚','QCZ'=>'卡坦扎罗','COB'=>'坎波巴索','CIY'=>'科摩','QCS'=>'科森扎','CRV'=>'克罗托内','CUN'=>'库内奥','LAQ'=>'拉奎拉','SPE'=>'拉斯佩齐亚','LCO'=>'莱科','LCC'=>'莱切','RNE'=>'雷焦艾米利亚','REG'=>'雷焦卡拉布里亚','LIV'=>'里窝那','ROM'=>'罗马','MCR'=>'马萨','MTR'=>'马泰拉','MZA'=>'蒙扎','MIL'=>'米兰','MOD'=>'摩德纳','MSN'=>'墨西拿','NAP'=>'那不勒斯','QNU'=>'努奥罗','NVR'=>'诺瓦拉','PMF'=>'帕尔马','PAV'=>'帕维亚','PEG'=>'佩鲁贾','CAX'=>'热那亚','SAL'=>'萨莱诺','QSS'=>'萨萨里','SVN'=>'萨沃纳','TAR'=>'塔兰托','TPS'=>'特拉帕尼','TRT'=>'特伦托','VCE'=>'威尼斯','VRL'=>'韦尔切利','VIT'=>'维泰博','UDN'=>'乌迪内','SYR'=>'锡拉库扎','SNA'=>'锡耶纳','ALE'=>'亚历山德里亚','ISE'=>'伊塞尔尼亚',)),
));
Core_Comm_City::$cityConfig['IND'] = array('name'=>'印度','province'=>array(
                ''=>array('name'=>'','city'=>array('AJL'=>'艾藻尔','BLR'=>'班加罗尔','PNY'=>'本地治里','BHO'=>'博帕尔','BBI'=>'布巴内斯瓦尔','IXC'=>'昌迪加尔','DAM'=>'达曼','DIU'=>'第乌','GTO'=>'甘托克','CJB'=>'哥印拜陀','CCU'=>'加尔各答','KRK'=>'加里加尔','JLR'=>'贾巴尔普尔','JUC'=>'贾朗达尔','JDH'=>'焦特布尔','MAA'=>'金奈','KVA'=>'卡瓦拉蒂','KOM'=>'科希马','MAH'=>'马埃','IXM'=>'马杜赖','SLR'=>'森伯尔布尔','TRV'=>'特里凡得琅','UDR'=>'乌代布尔','SHL'=>'西隆','SIL'=>'锡尔萨瓦','ICD'=>'新德里','SRV'=>'亚南','IMF'=>'因帕尔','IDR'=>'印多尔','JAI'=>'斋普尔',)),
));
Core_Comm_City::$cityConfig['IDN'] = array('name'=>'印度尼西亚','province'=>array(
                ''=>array('name'=>'','city'=>array('BA'=>'巴厘','BB'=>'邦加－勿里洞群岛','SA'=>'北苏拉威西','SU'=>'北苏门答腊','KB'=>'大雅加达首都特区','KI'=>'东加里曼丹','SG'=>'东南苏拉威西','NT'=>'东努沙登加拉','JI'=>'东爪哇','RI'=>'廖内','MA'=>'马鲁古','BE'=>'明古鲁','LA'=>'楠榜','KS'=>'南加里曼丹','SN'=>'南苏拉威西','SS'=>'南苏门答腊','YO'=>'日惹特区','BT'=>'万丹','NB'=>'西努沙登加拉','SR'=>'西苏门答腊','JB'=>'西爪哇','JK'=>'雅加达','AC'=>'亚齐','IJ'=>'伊里安查亚','JA'=>'占碑','KT'=>'中加里曼丹','ST'=>'中苏拉威西','JT'=>'中爪哇',)),
));
Core_Comm_City::$cityConfig['GBR'] = array('name'=>'英国','province'=>array(
                'NIR'=>array('name'=>'北爱尔兰','city'=>array('BFS'=>'贝尔法斯特','DRY'=>'德里','LSB'=>'利斯本','NYM'=>'纽里',)),
                'SCT'=>array('name'=>'苏格兰','city'=>array('ABD'=>'阿伯丁','EDH'=>'爱丁堡','DND'=>'丹迪','GLG'=>'格拉斯哥','STG'=>'斯特灵','INV'=>'因弗内斯',)),
                'WLS'=>array('name'=>'威尔士','city'=>array('BAN'=>'班戈','CDF'=>'卡迪夫','NWP'=>'纽波特','SWA'=>'斯旺西',)),
                'ENG'=>array('name'=>'英格兰','city'=>array('EXE'=>'爱塞特','BAS'=>'巴斯','PTE'=>'彼得伯勒','BIR'=>'伯明翰','BRD'=>'布拉德福德','BNH'=>'布莱顿与赫福','BST'=>'布里斯托尔','DER'=>'德比','DUR'=>'德罕','GLO'=>'格洛斯特','KUH'=>'赫尔河畔京斯敦','HAF'=>'赫里福德','CAM'=>'剑桥','CAX'=>'卡莱尔','CNG'=>'坎特伯雷','COV'=>'考文垂','LAN'=>'兰开斯特','RIP'=>'里彭','LHF'=>'利奇菲尔德','LIV'=>'利物浦','LDS'=>'利茲','LCE'=>'列斯特','LCN'=>'林肯','LND'=>'伦敦','MAN'=>'曼彻斯特','STH'=>'南安普敦','OXF'=>'牛津','NCL'=>'纽卡斯尔','NGM'=>'诺丁汉','NRW'=>'诺里奇','POR'=>'朴茨茅斯','PRE'=>'普雷斯顿','PLY'=>'普利茅斯','CST'=>'奇切斯特','CEG'=>'切斯特','SUN'=>'桑德兰','TBL'=>'圣阿本斯','SLS'=>'索尔斯堡','SLF'=>'索福特','TRU'=>'特鲁罗','SOT'=>'特伦特河畔斯多克','WLS'=>'威尔斯','WKF'=>'韦克菲尔德','WNE'=>'温彻斯特','WOV'=>'伍尔弗汉普顿','WOR'=>'伍斯特','SHE'=>'谢菲尔德','ELY'=>'伊利','YOR'=>'约克',)),
));
Core_Comm_City::$cityConfig['IOT'] = array('name'=>'英属印度洋领地',);
Core_Comm_City::$cityConfig['JOR'] = array('name'=>'约旦','province'=>array(
                ''=>array('name'=>'','city'=>array('AJ'=>'阿吉隆','AM'=>'安曼','BA'=>'拜勒加','JA'=>'杰拉什','KA'=>'卡拉克','RU'=>'鲁赛法','MN'=>'马安','MD'=>'马德巴','MF'=>'马夫拉克','TA'=>'塔菲拉','AQ'=>'亚喀巴','IR'=>'伊尔比德','ZA'=>'扎尔卡',)),
));
Core_Comm_City::$cityConfig['VNM'] = array('name'=>'越南','province'=>array(
                ''=>array('name'=>'','city'=>array('HP'=>'海防','HI'=>'河内','HC'=>'胡志明市',)),
));
Core_Comm_City::$cityConfig['ZMB'] = array('name'=>'赞比亚','province'=>array(
                ''=>array('name'=>'','city'=>array('NO'=>'北方','EA'=>'东方','LP'=>'卢阿普拉','LK'=>'卢萨卡','SO'=>'南方','CB'=>'铜带','NW'=>'西北','WE'=>'西方','CE'=>'中央',)),
));
Core_Comm_City::$cityConfig['JEY'] = array('name'=>'泽西岛',);
Core_Comm_City::$cityConfig['TCD'] = array('name'=>'乍得',);
Core_Comm_City::$cityConfig['GIB'] = array('name'=>'直布罗陀',);
Core_Comm_City::$cityConfig['CHL'] = array('name'=>'智利','province'=>array(
                ''=>array('name'=>'','city'=>array('AR'=>'阿劳卡尼亚大区','AT'=>'阿塔卡马大区','AN'=>'安托法加斯塔大区','BI'=>'比奥比奥大区','LI'=>'复活节岛','LL'=>'湖大区','CO'=>'科金博大区','ML'=>'马乌莱大区','MA'=>'麦哲伦-智利南极大区','RM'=>'圣地亚哥','TA'=>'塔拉帕卡大区','VS'=>'瓦尔帕莱索大区','AI'=>'伊瓦涅斯将军的艾森大区',)),
));
Core_Comm_City::$cityConfig['CAF'] = array('name'=>'中非共和国','province'=>array(
                ''=>array('name'=>'','city'=>array('BB'=>'巴明吉-班戈兰','BGF'=>'班吉直辖市','BI'=>'宾博','KG'=>'凯莫','LB'=>'洛巴伊','HS'=>'曼贝雷-卡代','MB'=>'姆博穆','KB'=>'纳纳-格里比齐','NM'=>'纳纳-曼贝雷','SE'=>'桑加-姆巴埃雷','HK'=>'上科托','HM'=>'上姆博穆','UK'=>'瓦卡','VK'=>'瓦卡加','AC'=>'瓦姆','OP'=>'瓦姆-彭代','MP'=>'翁贝拉-姆波科','BK'=>'下科托',)),
));
